[
  {
    "id": "54",
    "name": "Techno Jashan: A Vibrant Celebration of Talent and Creativity",
    "title": "Techno Jashan: A Vibrant Celebration of Talent and Creativity",
    "date": "2024-04-30",
    "about": "Techno Jashan, a cultural extravaganza organized by Guru Nanak College Dehradun, kicked off with a burst of enthusiasm and talent on its first day. The event, held on the 1st of June, 2024, was a melting pot of creativity, showcasing the diverse talents of the college's students.",
    "image": "assets/images/events/gnc-events-dance-img.webp",
    "image2": "assets/images/events/gnc-events-tchno-img1.webp",
    "image3": "assets/images/events/gnc-events-technoimgs4.webp",
    "category": "Educational",
    "description": "The day started with electrifying dance performances that set the stage on fire. From classical to contemporary, the dancers mesmerized the audience with their skill and passion. The music lovers were treated to soulful singing performances that touched the heart and uplifted the spirit. Adding to the excitement were the captivating fashion walks, where students strutted down the runway with style and confidence. The fashion show was a visual delight, highlighting the creativity and flair of the budding designers. Throughout the day, the atmosphere was filled with energy and excitement, as students and audience members alike were swept away by the talent on display. Whether you're a music lover, a fashion enthusiast, or simply looking for some entertainment, Techno Jashan had something for everyone. As the event unfolds over the coming days, we can expect more unforgettable moments that celebrate the talent and creativity of Guru Nanak College Dehradun's students. Stay tuned for more updates and get ready to be amazed!",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "30 April 2024"
  },
  {
    "id": "53",
    "name": "Inter-College Competition",
    "title": "Inter-College Competition",
    "date": "2024-04-29",
    "about": " the Guru Nanak College of Pharmaceutical Sciences hosted an exhilarating Inter-College Competition, bringing together talented students from various institutions to showcase their skills and creativity. The college campus buzzed with excitement as participants gathered to compete in a wide range of events spanning academic, cultural, and sports disciplines.",
    "image": "assets/images/events/gnc-events-technoimg1.webp",
    "image2": "assets/images/events/gnc-events-techoimg2.webp",
    "image3": "assets/images/events/gnc-events-technoimg3.webp",
    "category": "Sports",
    "description": "The competition featured academic quizzes, debates, and poster presentations, allowing students to demonstrate their knowledge and expertise in their respective fields. Cultural events such as music performances, dance competitions, and art exhibitions added vibrancy to the atmosphere, showcasing the diverse talents of the participants. Sports enthusiasts engaged in friendly matches of cricket, football, and volleyball, fostering camaraderie and sportsmanship. Faculty members and industry professionals served as judges and mentors, providing guidance and encouragement to the participants. The Inter-College Competition was a celebration of talent, creativity, and teamwork, highlighting the spirit of excellence and collaboration that thrives within the academic community.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "29 April 2024"
  },
  {
    "id": "52",
    "name": "Visit to Parliament of India",
    "title": "Students Experience the Pulse of Indian Democracy",
    "date": "2024-04-26",
    "about": "The Guru Nanak College of Pharmaceutical Sciences organized an enlightening visit to the Indian Parliament for its scholars on the 26th of April, 2024. This visit aimed to immerse students in the essence of governance and legislative discourse, thereby recognizing the importance of civic engagement in their holistic development. Nearly all the students from Pharmaceutical department participated in this unique experience.",
    "image": "assets/images/events/gnc-image-events2.webp",
    "image2": "assets/images/events/gnc-image-events1.webp",
    "image3": "assets/images/events/gnc-image-events3.webp",
    "category": "Educational",
    "description": "The event was graced by the presence of Mrs. Vineet Arora – COO, Guru Nanak College of Pharmaceutical Sciences. Along with the chief guest, faculty members from Pharmaceutical department were also present to support the students. The visit was designed to ignite a passion for active citizenship and provide firsthand experience of India's democratic processes. The event received positive feedback from both students and faculty members, with many expressing their appreciation for the college's efforts to organize such a captivating and educational visit. Overall, the Parliament visit served its purpose of fostering a sense of civic responsibility and engagement within the college community. In conclusion, this visit was a memorable and inspiring experience for all participants, contributing to their overall understanding of and commitment to active citizenship.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "26 April 2024"
  },
  {
    "id":"51",
    "name":"Research seminar on Orientation to Entrepreneurship for Aspiring Pharmacists",
    "title": "Research seminar on Orientation to Entrepreneurship for Aspiring Pharmacists",
    "date": "2024-03-22" ,
    "about": "The seminar on Orientation to Entrepreneurship for Aspiring Pharmacists was held on 22-03-2024 at Guru Nanak College of Pharmaceutical Sciences, consisting of pharmacy students, recent graduates, and young professionals interested in entrepreneurship within the pharmaceutical domain.",
    "image": "",
    "image2": "",
    "image3": "",
    "category": "",
    "description":"The seminar on Orientation to Entrepreneurship for Aspiring Pharmacists successfully achieved its objectives by equipping participants with essential entrepreneurial knowledge, industry insights, and practical skills tailored to their professional aspirations in pharmacy. The event fostered a supportive environment for networking, mentorship, and collaboration among future pharmacist entrepreneurs." ,
    "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "22 March 2024"

  },
  {
    "id": "50",
    "name": "Colors of Unity: Pre-Holi Celebration",
    "title": "Colors of Unity: Pre-Holi Celebration",
    "date": "2024-03-24",
    "about": "On 23-03-2024, Guru Nanak College in Dehradun came alive with the vibrant colors of Holi as students and faculty joined together for a joyous pre-Holi celebration. The campus was transformed into a kaleidoscope of hues, echoing with laughter, showcasing the unity and spirit of the college community.",
    "image": "assets/images/events/gnc-events-holiimg.webp",
    "image2": "assets/images/events/gnc-events-holiimg1.webp",
    "image3": "assets/images/events/gnc-events-holiimg2.webp",
    "category": "cultural",
    "description": "The event was a true reflection of the college's ethos, where diversity is celebrated, and bonds are strengthened through shared experiences. Students and faculty alike participated in the festivities with great enthusiasm, embracing the joyous atmosphere and spreading the message of harmony and togetherness. From traditional music and dance performances to colorful rangoli and food stalls, every aspect of the celebration was meticulously planned to ensure a memorable experience for everyone. Students had the opportunity to not only enjoy the festivities but also learn about the cultural significance of Holi and its importance in Indian tradition. The highlight of the event was the spirit of inclusivity and unity that permeated throughout the campus. Regardless of background or beliefs, everyone came together as one big family, united by the joyous spirit of Holi. In conclusion, the pre-Holi celebration at Guru Nanak College was a resounding success, showcasing the rich cultural heritage of India and fostering a sense of unity and togetherness among the college community. It was a day filled with joy, laughter, and colorful memories that will be cherished for years to come.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "24 March 2024"
  },
  {
    "id": "49",
    "name": "National Workshop",
    "title": "National Workshop",
    "date": "2024-03-14",
    "about": "the Guru Nanak College of Pharmaceutical Sciences hosted a National Workshop  on the 14th of march that brought together scholars, industry experts, and students for a day of intensive learning and collaboration. The workshop focused on recent advancements in pharmaceutical sciences and their applications. The college campus was bustling with activity as participants from various institutions gathered to exchange knowledge and ideas.",
    "image": "assets/images/events/gnc-events-workshopimg.webp",
    "image2": "assets/images/events/gnc-events-workshopimg1.webp",
    "image3": "assets/images/events/gnc-events-workshopimg2.webp",
    "category": "Educational",
    "description": "The event featured keynote addresses by prominent researchers, interactive sessions, and hands-on demonstrations of cutting-edge technologies. Workshops were conducted on topics such as drug development, biotechnology, and regulatory affairs, providing attendees with valuable insights and practical skills. Poster presentations and networking sessions allowed students to showcase their research and connect with professionals in their field. Nearly all students from the Pharmaceutical department participated, reflecting their eagerness to engage with the latest developments in their discipline. The National Workshop was a tremendous success, fostering a collaborative environment that encouraged innovation, professional growth, and a deeper understanding of pharmaceutical sciences.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "14 March 2024"
  },
  {
    "id": "48",
    "name": "World Glaucoma week",
    "title": "World Glaucoma week",
    "date": "2024-03-10",
    "about": "The Guru Nanak College of Pharmaceutical Sciences organized an enlightening visit to the Indian Parliament for its scholars on the 10th of March, 2024. This visit aimed to immerse students in the essence of governance and legislative discourse, thereby recognizing the importance of civic engagement in their holistic development. Nearly all the students from Pharmaceutical department participated in this unique experience.",
    "image": "assets/images/events/gnc-events-glacuoma-img.webp",
    "image2": "assets/images/events/gnc-events-glacuoma-img1.webp",
    "image3": "assets/images/events/gnc-events-glacuoma-img2.webp",
    "category": "Educational",
    "description": "The event was graced by the presence of Mrs. Vineet Arora – COO, Guru Nanak College of Pharmaceutical Sciences. Along with the chief guest, faculty members from Pharmaceutical department were also present to support the students. The visit was designed to ignite a passion for active citizenship and provide firsthand experience of India's democratic processes. The event received positive feedback from both students and faculty members, with many expressing their appreciation for the college's efforts to organize such a captivating and educational visit. Overall, the Parliament visit served its purpose of fostering a sense of civic responsibility and engagement within the college community. In conclusion, this visit was a memorable and inspiring experience for all participants, contributing to their overall understanding of and commitment to active citizenship.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "10 March 2024"
  },
  {
    "id": "47",
    "name": "Women's Day Celebration",
    "title": "Women's Day Celebration",
    "date": "2024-03-08",
    "about": "the Guru Nanak College of Pharmaceutical Sciences celebrated International Women’s Day On the 8th of March with great enthusiasm and reverence. The event was dedicated to honoring the achievements and contributions of women in various fields. The college campus was adorned with banners and posters highlighting the theme of gender equality and women's empowerment.",
    "image": "assets/images/events/gnc-events-womencele-img.webp",
    "image2": "assets/images/events/gnc-events-womencele-img1.webp",
    "image3": "assets/images/events/gnc-events-womencele-img2.webp",
    "category": "cultural",
    "description": " The celebration began with an inspiring keynote speech by a renowned female leader, emphasizing the importance of women's rights and equality. This was followed by a series of activities, including panel discussions, workshops on women’s health and career development, and cultural performances showcasing the talents of female students. An exhibition was also organized, displaying the accomplishments of women scientists, entrepreneurs, and leaders. Nearly all students, along with faculty members, participated actively, reflecting the collective commitment to fostering an inclusive and supportive environment. The Women’s Day celebration was a resounding success, reinforcing the values of respect, equality, and empowerment, and contributing to the holistic development of students by promoting awareness and appreciation of gender issues.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "08 March 2024"
  },
  {
    "id": "46",
    "name": "Science Exhibition",
    "title": "Science Exhibition",
    "date": "2024-02-28",
    "about": "On the 26th of April, the Guru Nanak College of Pharmaceutical Sciences hosted a dynamic Science Exhibition, showcasing the innovative spirit and scientific curiosity of its students. The college campus was abuzz with excitement as students from the Pharmaceutical department and other disciplines presented their research projects and experiments.",
    "image": "assets/images/events/gnc-events-scienceexibition-img.webp",
    "image2": "assets/images/events/gnc-events-scienceexibition-img1.webp",
    "image3": "assets/images/events/gnc-events-scienceexibition-img2.webp",
    "category": "Educational",
    "description": "The exhibition featured a diverse range of displays, including cutting-edge pharmaceutical research, sustainable energy solutions, and advanced medical technologies. Faculty members and industry experts evaluated the projects, providing valuable feedback and encouragement to the young scientists. Interactive sessions and live demonstrations captivated the audience, highlighting the practical applications of scientific principles. This event not only provided a platform for students to exhibit their work but also fostered a collaborative environment for the exchange and development of ideas. Nearly all students from the Pharmaceutical department participated, demonstrating their commitment to scientific inquiry and innovation. The Science Exhibition was a resounding success, inspiring students to pursue excellence in their fields and contributing to their holistic development through experiential learning.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "28 February 2024"
  },
  {
   "id": "45",
    "name": "Research seminar on Introduction to IP Rights: Key Concepts and Applications",
    "title": "Research seminar on Introduction to IP Rights: Key Concepts and Applications",
    "date": "2024-01-30",
    "about": "The seminar on Introduction to IP Rights: Key Concepts and Applications was conducted successfully on 30-01-2024. The event gathered 59 students from department of pharmaceutical science.",
    "image": "",
    "image2": "",
    "image3": "",
    "category": "",
    "description": "The seminar on Introduction to IP Rights: Key Concepts and Applications achieved its objectives by equipping participants with essential knowledge and practical insights into intellectual property. It underscored the critical role of IP rights in fostering innovation, protecting creativity, and driving economic development across industries.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate":"30 January 2024"
  },
  {
    "id": "44",
    "name": "Happy Republic Day",
    "title": "Happy Republic Day",
    "date": "2024-01-26",
    "about": "On the 26th of January, 2024, the Guru Nanak College of Pharmaceutical Sciences celebrated Republic Day with immense pride and patriotic fervor. The college campus was adorned with the tricolor decorations, and the air resonated with patriotic songs. The event commenced with the hoisting of the national flag, followed by the singing of the national anthem, evoking a sense of unity and national pride.",
    "image": "assets/images/events/gnc-events-republicimg1.webp",
    "image2": "assets/images/events/gnc-events-republicimg3.webp",
    "image3": "assets/images/events/gnc-events-republicimg2.webp",
    "category": "cultural",
    "description": "The celebration featured inspiring speeches by faculty members, highlighting the importance of the day and the values enshrined in the Constitution. Students showcased their talents through cultural performances, including traditional dances and patriotic songs, emphasizing the diversity and unity of the nation. Additionally, a special exhibition was organized, displaying projects and artworks created by students that depicted India's rich heritage and achievements. Nearly all students from the Pharmaceutical department participated, reflecting their respect for the nation and their commitment to civic engagement. The Republic Day celebration was a profound reminder of the importance of democracy, freedom, and responsibility, instilling a sense of national pride and unity among the students.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "26 January 2024"
  },
  {
    "id": "43",
    "name": "Happy Lohri",
    "title": "Happy Lohri",
    "date": "2024-01-14",
    "about": "On the 14th of January, 2024, the Guru Nanak College of Pharmaceutical Sciences celebrated Lohri with vibrant enthusiasm and cultural richness. The college courtyard was transformed into a festive arena, beautifully decorated with traditional Punjabi motifs and filled with the joyous sounds of folk music. Central to the celebration was the lighting of a grand bonfire, around which students gathered to offer peanuts, popcorn, sesame seeds, and jaggery, symbolizing gratitude and the end of winter.",
    "image": "assets/images/events/gnc-events-lohriimg1.webp",
    "image2": "assets/images/events/gnc-events-lohriimg3.webp",
    "image3": "assets/images/events/gnc-events-lohriimg2.webp",
    "category": "cultural",
    "description": "The event was marked by lively Bhangra and Gidda performances, accompanied by the rhythmic beats of the dhol, which enlivened the atmosphere and encouraged everyone to participate. Traditional Punjabi delicacies such as makki di roti and sarson da saag were served, enhancing the festive spirit with authentic flavors. Stories and legends, including the tale of Dulla Bhatti, were shared, enriching the cultural experience and connecting students with the festival's historical significance. Nearly all students from the Pharmaceutical department took part, fostering a sense of unity and cultural appreciation. The Lohri celebration was a memorable event, highlighting the importance of cultural traditions in enriching student life and contributing to their holistic development.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "14 January 2024"
  },
  {
    "id": "42",
     "name": "Research seminar on Exploring R&D Applications in the Agri-Pharma Sector",
     "title": "Research seminar on Exploring R&D Applications in the Agri-Pharma Sector",
     "date": "2023-12-20",
     "about": "The Exploring R&D Applications in the Agri-Pharma Sector research seminar held on 20-12-2023 at Guru Nanak College of Pharmaceutical Sciences brought together a diverse group of researchers, scientists, and industry leaders interested in exploring the potential of agricultural resources in pharmaceutical R&D.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Exploring R&D Applications in the Agri-Pharma Secto research seminar successfully achieved its objectives by providing a platform for knowledge exchange, collaborative discussions, and exploration of innovative R&D applications. Participants gained valuable insights into emerging trends and opportunities in leveraging agricultural resources for pharmaceutical advancements.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"20 December 2023"
   },
   {
    "id": "41",
     "name": "Research Seminar on Analysing Patents: Skills Workshop",
     "title": "Research Seminar on Analysing Patents: Skills Workshop",
     "date": "2023-10-13",
     "about": "The Analysing Patents: Skills Workshop research seminar held on 13-10-2023 at Guru Nanak College of Pharmaceutical Sciences gathered professionals, researchers, and students interested in mastering the art of patent analysis in pharmaceutical and biotechnological sectors.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Analysing Patents: Skills Workshop research seminar successfully achieved its objectives by equipping participants with practical skills, knowledge, and tools essential for effective patent analysis in pharmaceutical and biotechnological domains. Attendees gained valuable insights and enhanced their professional capabilities in intellectual property management and innovation strategy.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"13 October 2023"
   },
   {
    "id": "40",
     "name": "Research Horizons: India and International Perspectives",
     "title": "Research Horizons: India and International Perspectives",
     "date": "2023-09-26",
     "about": "The Research Horizons: India and International Perspectives event held on 26-09-2023 at Guru Nanak College of Pharmaceutical Sciences brought together a diverse group of researchers, scholars, and industry experts to explore and discuss research advancements from both Indian and global perspectives.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Research Horizons: India and International Perspectives event was a resounding success, achieving its objectives of promoting cross-cultural understanding, facilitating knowledge exchange, and strengthening collaborative efforts in research and development. The event not only provided valuable insights into global research trends but also inspired participants to explore new avenues for research excellence and innovation.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"26 September 2023"
   },
   {
    "id": "39",
     "name": "Research seminar on Exploring Strategies for Designing Next-Generation Medications",
     "title": "Research seminar on Exploring Strategies for Designing Next-Generation Medications",
     "date": "2023-09-19",
     "about": "On 19th September 2023, Guru Nanak College of Pharmaceutical Sciences hosted a dynamic research seminar titled Exploring Strategies for Designing Next-Generation Medications. The seminar aimed to delve into innovative approaches and methodologies crucial for advancing the field of pharmaceutical sciences.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar on Exploring Strategies for Designing Next-Generation Medications proved to be an enriching experience for all attendees. It provided a platform for learning, sharing, and envisioning future advancements in pharmaceutical sciences. The insights gained from this seminar are expected to catalyse further research initiatives at Guru Nanak College of Pharmaceutical Sciences, contributing to the development of innovative medications that enhance patient care globally.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"19 September 2023"
   },
  {
    "id": "38",
    "name": "Poster Presentation",
    "title": "Poster Presentation",
    "date": "2023-08-25",
    "about": "On August 25, 2023, Guru Nanak College of Pharmaceutical Sciences organized a Poster Presentation Event, providing a platform for students to showcase their innovative projects. The event aimed to foster academic excellence, and promote scholarly communication among students and faculty members.The event venue was arranged with display boards and stands to accommodate the presentation of posters. Each participant was assigned a designated space to showcase their poster, along with accompanying materials such as charts, graphs, and visual aids to illustrate their research findings effectively. Participants had the opportunity to present their research posters on various topics related to pharmaceutical sciences, including drug discovery, pharmacology, pharmaceutical technology, and clinical pharmacy.",
    "image": "assets/images/events/gnc-posterpresen-img1.webp",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "description": "A diverse range of research topics were presented during the event, covering areas such as novel drug delivery systems, pharmacological mechanisms of action, therapeutic efficacy of pharmaceutical compounds, and clinical outcomes of patient interventions. Participants explored current trends and challenges in pharmaceutical research and proposed innovative solutions to address them. A panel of faculty members and experts in pharmaceutical sciences evaluated the poster presentations based on criteria such as scientific merit, clarity of presentation, originality of research, and depth of understanding. Participants were given the opportunity to present their posters and engage in discussions with the evaluators to further elaborate on their research findings. The Event facilitated knowledge sharing and participants exchanged ideas, insights, and feedback on their projects, fostering interdisciplinary collaboration and stimulating intellectual discourse within the college community.Outstanding poster presentations were recognized and awarded based on merit and innovation. Participants who demonstrated exceptional research skills, creativity, and scientific consistency were acknowledged for their contributions. Certificates were presented to winners during a closing ceremony, honouring their achievements and inspiring others to pursue excellence in research",
    "category": "training",
    "eventdate": "25 August 2023"
  },
  {
    "id": "37",
    "name": "Hospital Visit 2023 - CMI",
    "title": "Hospital Visit 2023 - CMI",
    "date": "2023-08-17",
    "about": "The visit to CMI Hospital organized by the Pharmacy Department of Guru Nanak College of Pharmaceutical Sciences on August 17, 2023, was a valuable learning experience for students, providing them with first-hand exposure to hospital pharmacy practices and interdisciplinary healthcare collaboration. It allowed students to gain practical insights into the role of pharmacists in patient care and medication management within a clinical setting, further enriching their education and preparing them for future careers in pharmacy practice.",
    "image": "assets/images/events/gnc-hospitalvisit-img.webp",
    "category": "Educational",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "description": "Throughout the visit, students were immersed in the bustling environment of a clinical setting, where they witnessed firsthand the pivotal role pharmacists play in patient care and medication management. By shadowing seasoned professionals and engaging in interactive sessions, they gained practical insights into the multifaceted responsibilities of pharmacists within the healthcare ecosystem. The experience not only broadened their academic horizons but also equipped them with tangible skills and knowledge essential for their future endeavors in pharmacy practice. Interactions with healthcare professionals facilitated a comprehensive understanding of collaborative approaches to patient care, emphasizing the crucial interplay between various healthcare disciplines. Overall, the visit to CMI Hospital served as a catalyst for the holistic development of the students, empowering them with the confidence and expertise needed to navigate the intricacies of contemporary pharmacy practice. It underscored the significance of experiential learning in augmenting traditional classroom education, thereby preparing them for the challenges and opportunities that lie ahead in their careers.",
    "eventdate": "17 August 2023"
  },
  {
    "id": "36",
    "name": "Dengue awareness Rally",
    "title": "Dengue awareness Rally",
    "date": "2023-08-01",
    "about": "The Dengue Awareness Rally organized by NSS section of Guru Nanak College of Pharmaceutical Sciences in Jhajra was a commendable initiative aimed at raising awareness about dengue fever and promoting preventive measures. Through the rally, participants effectively disseminated information to the community, empowering them to take proactive steps to prevent the spread of dengue. The event exemplified the college's commitment to community health and disease prevention, and it highlighted the importance of collective action in combating public health challenges like dengue fever.",
    "image": "assets/images/events/gnc-fightogether-img.webp",
    "category": "Educational",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "description": "The rally saw enthusiastic participation from students, faculty, and members of the local community. As the procession wound its way through the streets, participants distributed informational pamphlets and engaged in conversations with residents, emphasizing the importance of maintaining clean surroundings, eliminating breeding sites for mosquitoes, and seeking timely medical attention in case of symptoms. The event not only educated the community about the dangers of dengue but also empowered them with practical knowledge to protect themselves and their families. It exemplified the college's commitment to community health and disease prevention, demonstrating the role of educational institutions in addressing public health challenges. By mobilizing collective action and fostering community participation, the Dengue Awareness Rally served as a shining example of proactive efforts to combat diseases and promote well-being.",
    "eventdate": "01 August 2023"
  },
  {
    "id": "35",
     "name": "Research workshop on Systematic Approach to Pharmaceutical Care",
     "title": "Research workshop on Systematic Approach to Pharmaceutical Care",
     "date": "2023-07-25",
     "about": "The Workshop on Systematic Approach to Pharmaceutical Care held at the Guru Nanak College of Pharmaceutical Sciences on July 25, 2023, was facilitated by Ms. Bhawna Bora for B.Pharm students. With over 80 participants, the workshop aimed to impart practical skills and insights into patient-centered pharmacy practice. Through structured sessions, case-based learning, role-playing exercises, and interactive discussions, students gained valuable knowledge and competencies essential for delivering effective pharmaceutical care. The workshop successfully achieved its objectives, providing a platform for professional development and preparing students for their future roles as competent pharmacists.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Workshop on Systematic Approach to Pharmaceutical Care, organized by the Guru Nanak College of Pharmaceutical Sciences and facilitated by Ms. Bhawna Bora, was highly successful in achieving its objectives. Through structured sessions, case-based learning, role-playing exercises, and interactive discussions, students gained valuable insights and practical skills essential for delivering patient-centered pharmaceutical care. The workshop served as a platform for fostering professional development and preparing students for their future roles as competent and compassionate pharmacists.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"25 July 2023 "
   },
   {
    "id": "34",
     "name": "Research Seminar on How to Design Future Medicines",
     "title": "Research Seminar on How to Design Future Medicines",
     "date": "2023-07-08",
     "about": "The Research Seminar on How to Design Future Medicines, conducted by Ms. Kriti Dabral on behalf of the Guru Nanak College of Pharmaceutical Sciences Dehradun (GNC), took place on July 8, 2023. ",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Research Seminar on How to Design Future Medicines, organized by the Guru Nanak College of Pharmaceutical Sciences Dehradun (GNC) and led by Ms. Kriti Dabral, went out to be a very successful one. The event effectively fulfilled its objectives of educating B.Pharm students about the details of pharmaceutical research and inspiring them to contribute to the development of future medicines. With its informative sessions and interactive discussions, the seminar proved to be a valuable learning experience for all attendees.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"08 July 2023"
   },
  {
    "id": "33",
    "name": "Yoga Day 2023",
    "title": "Yoga Day 2023",
    "date": "2023-06-21",
    "about": "Yoga Day 2023 was celebrated with great fervor and enthusiasm at Guru Nanak College of Pharmaceutical Sciences on June 21, 2023. The event aimed to promote the ancient practice of yoga and its numerous benefits for physical, mental, and spiritual well-being. The event commenced with invigorating yoga sessions led by experienced instructors. Participants engaged in various yoga asanas (postures) and pranayama (breathing exercises) to rejuvenate their mind and body. Renowned yoga experts were invited to deliver enlightening lectures on the significance of yoga in modern-day life. They emphasized the importance of incorporating yoga into daily routines for stress management and holistic health.",
    "image": "assets/images/events/gnc-yogaday-img.webp",
    "category": "cultural",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "description": "Live demonstrations of advanced yoga poses were conducted to inspire participants to explore the depths of their physical capabilities and enhance their yoga practice.Interactive workshops were organized to educate attendees about the therapeutic aspects of yoga and its potential in alleviating common health issues such as anxiety, insomnia, and back pain. The event also included guided meditation sessions to cultivate inner peace and mindfulness among participants. Meditation is an integral aspect of yoga practice, promoting mental clarity and emotional balance. To add a touch of cultural richness to the event, traditional Indian dance and music performances were showcased, highlighting the spiritual essence of yoga. The event witnessed enthusiastic participation from students, faculty members, and staff, reflecting the growing interest in yoga among the college community. Participants expressed deep appreciation for the opportunity to learn and experience the transformative power of yoga firsthand. Positive feedback was received regarding the organization and execution of the event, indicating its success in achieving its objectives. Yoga Day 2023 at Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering a deeper understanding and appreciation for yoga as a holistic practice for physical, mental, and spiritual well-being. The event served as a reminder of the timeless wisdom of yoga and its relevance in the modern world.",
    "eventdate": "21 June 2023"
  },
  {
    "id": "32",
    "name": "Pharmacy Department Students' Visit to Kailash Hospital, Dehradun",
    "title": "Pharmacy Department Students' Visit to Kailash Hospital, Dehradun",
    "date": "2023-03-2",
    "about": "Yoga Day 2023 was celebrated with great fervor and enthusiasm at Guru Nanak College of Pharmaceutical Sciences on June 21, 2023. The event aimed to promote the ancient practice of yoga and its numerous benefits for physical, mental, and spiritual well-being. The event commenced with invigorating yoga sessions led by experienced instructors. Participants engaged in various yoga asanas (postures) and pranayama (breathing exercises) to rejuvenate their mind and body. Renowned yoga experts were invited to deliver enlightening lectures on the significance of yoga in modern-day life. They emphasized the importance of incorporating yoga into daily routines for stress management and holistic health.",
    "image": "assets/images/events/gnc-hospitalvisit2-img.webp",
    "category": "Educational",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "description": "Live demonstrations of advanced yoga poses were conducted to inspire participants to explore the depths of their physical capabilities and enhance their yoga practice.Interactive workshops were organized to educate attendees about the therapeutic aspects of yoga and its potential in alleviating common health issues such as anxiety, insomnia, and back pain. The event also included guided meditation sessions to cultivate inner peace and mindfulness among participants. Meditation is an integral aspect of yoga practice, promoting mental clarity and emotional balance. To add a touch of cultural richness to the event, traditional Indian dance and music performances were showcased, highlighting the spiritual essence of yoga. The event witnessed enthusiastic participation from students, faculty members, and staff, reflecting the growing interest in yoga among the college community. Participants expressed deep appreciation for the opportunity to learn and experience the transformative power of yoga firsthand. Positive feedback was received regarding the organization and execution of the event, indicating its success in achieving its objectives. Yoga Day 2023 at Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering a deeper understanding and appreciation for yoga as a holistic practice for physical, mental, and spiritual well-being. The event served as a reminder of the timeless wisdom of yoga and its relevance in the modern world.",
    "eventdate": "21 June 2023"
  },
  {
    "id": "31",
     "name": "Research Seminar on Advances in Pharmaceutical Technology",
     "title": "Research Seminar on Advances in Pharmaceutical Technology",
     "date": "2023-04-14",
     "about": "The seminar commenced with an opening address by Mrs. Yashika Uniyal, highlighting the significance of staying updated with the latest developments in pharmaceutical technology for aspiring pharmacists. This was followed by the keynote speech delivered by Kriti Dabral, wherein she shared her insights into emerging trends and future prospects in the field.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Overall, the Research Seminar on Advances in Pharmaceutical Technology proved to be a resounding success, achieving its objectives of educating, inspiring, and empowering B.Pharm students to excel in their academic and professional pursuits. The event concluded with a vote of thanks, expressing gratitude to the speakers, organizers, and participants for their contributions towards making the seminar a memorable and enriching experience.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"14 April 2023"
   },
   {
    "id": "30",
     "name": "Seminar on Importance of Pharmaco-economics in Pharma research",
     "title": "Seminar on Importance of Pharmaco-economics in Pharma research",
     "date": "2023-01-17",
     "about": "The Seminar on Importance of Pharmaco-economics in Pharma research, spearheaded by Dr. Mohit Gupta on behalf of the Guru Nanak College of Pharmaceutical Sciences, was held on January 17, 2023. The seminar focused on enlightening B. Pharm students about the crucial role of pharmaco-economics in shaping pharmaceutical research and healthcare policies.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar on Importance of Pharmaco-economics in Pharma research, organized by the Guru Nanak College of Pharmaceutical Sciences and led by Dr. Mohit Gupta, successfully achieved its objectives of educating B. Pharm students about the significance of pharmaco-economics. Through expert presentations, and interactive discussions students gained valuable insights into how economic principles influence pharmaceutical research and healthcare decision-making. The seminar served as a valuable platform for students to broaden their understanding and appreciation of the interdisciplinary nature of pharmaceutical sciences.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"17 January 2023"
   },
   {
    "id": "29",
     "name": "Research Methodology Workshop on Drug Discovery",
     "title": "Research Methodology Workshop on Drug Discovery",
     "date": "2023-01-16",
     "about": "The Research Methodology Workshop on Drug Discovery was conducted by the Guru Nanak College of Pharmaceutical Sciences on January 16, 2023 led by Mrs. Yashika Uniyal, the workshop aimed to enhance the research skills of B.Pharm students in the field of drug discovery. With a participation of over 100 students, the workshop provided valuable insights and practical knowledge on research methodologies pertinent to pharmaceutical science.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Research Methodology Workshop on Drug Discovery, conducted by the Guru Nanak College of Pharmaceutical Sciences and led by Mrs. Yashika Uniyal, was a resounding success. The workshop effectively fulfilled its objectives of enhancing the research skills and knowledge of B.Pharm students in the field of drug discovery. With its expert guidance, interactive sessions, practical demonstrations, and networking",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"16 January 2023"
   },
   {
    "id": "28",
     "name": "Seminar on Entrepreneurship Development",
     "title": "Seminar on Entrepreneurship Development",
     "date": "2022-12-16",
     "about": "The Seminar on Entrepreneurship Development commenced with an opening address by the organizing committee, emphasizing the importance of entrepreneurship in driving innovation, economic growth, and job creation in the pharmaceutical sector. The event featured a series of interactive sessions, presentations, and panel discussions led by Mr. Saithjeet Arora and faculty members, covering various aspects of entrepreneurship.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Moreover, the seminar facilitated networking opportunities, allowing students to connect with industry professionals and fellow peers interested in entrepreneurship. The event concluded with a closing remark, expressing gratitude to the speakers, organizers, and participants for their contributions and active involvement in making the seminar a success.In summary, the Seminar on Entrepreneurship Development served as a platform for B.Pharm students to explore and embrace the entrepreneurial mindset, acquire essential skills and knowledge, and gain inspiration from industry leaders and successful entrepreneurs. The event provided a valuable learning experience and laid the groundwork for students to pursue entrepreneurial ventures and make meaningful contributions to the pharmaceutical industry.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"16 December 2022"
   },
   {
    "id": "27",
     "name": "Seminar on Research on Evidence-Based Medicine",
     "title": "Seminar on Research on Evidence-Based Medicine",
     "date": "2022-12-01",
     "about": "The Seminar on Research on Evidence-Based Medicine, organized by the Guru Nanak College of Pharmaceutical Sciences, took place on December 1, 2022. The seminar focused on educating B.Pharm students about the significance of evidence-based medicine in healthcare and the role of research in generating reliable evidence to inform clinical practice.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar on Research on Evidence-Based Medicine, conducted by the Guru Nanak College of Pharmaceutical Sciences and led by Ms. Kriti Dabral, was highly successful in achieving its objectives. Through expert presentations, case studies, interactive discussions, and a large turnout of participants, the seminar provided B. Pharm students with valuable insights into the principles and practices of evidence-based medicine. It inspired students to recognize the importance of research in informing clinical decision-making and motivated them to actively engage in research activities to contribute to evidence-based healthcare.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"01 December 2022"
   },
   {
    "id": "26",
     "name": "Research Seminar on Advances in Biotechnology",
     "title": "Research Seminar on Advances in Biotechnology",
     "date": "2022-11-19",
     "about": "The Research Seminar on Advances in Biotechnology commenced with an opening address by the organizing committee, highlighting the significance of biotechnology in advancing healthcare and pharmaceutical research. The event featured presentations, lectures, and interactive sessions led by renowned researchers, faculty members, and industry experts, covering various topics.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The sessions were designed to provide students with a comprehensive overview of the latest advancements and emerging trends in biotechnology, as well as to encourage critical thinking and discussion on the ethical and societal implications of biotechnological innovations. Students actively engaged in discussions, asked questions, and shared their insights and perspectives on the topics discussed.Moreover, the seminar provided networking opportunities for students to interact with speaker Mrs. Yashika Uniyal, faculty members, and peers interested in biotechnology. Attendees had the chance to exchange ideas, collaborate on research projects, and explore potential career paths in the field of biotechnology.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"19 November 2022"
   },
   {
    "id": "25",
     "name": "Workshop on Patent Search and Analysis",
     "title": "Workshop on Patent Search and Analysis",
     "date": "2022-10-07",
     "about": "The Workshop on Patent Search and Analysis commenced with an introductory session wherein the importance of patent searching and analysis in pharmaceutical sciences was emphasized. The event featured interactive presentations, demonstrations, and practical exercises led by experienced faculty members.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Moreover, the workshop facilitated peer-to-peer learning and collaboration, allowing students to exchange ideas, share experiences, and discuss challenges encountered during patent searching and analysis. The event concluded with a closing remark, expressing gratitude to the speakers, organizers, and participants for their active involvement and contributions towards making the workshop a success.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"07 October 2022"
   },
   {
    "id": "24",
     "name": "Workshop on the Use of Patent Information Systems for the Promotion of Innovation",
     "title": "Workshop on the Use of Patent Information Systems for the Promotion of Innovation",
     "date": "2022-09-23",
     "about": "The Workshop on the “Use of Patent Information Systems for the Promotion of Innovation” commenced with an introductory session highlighting the role of patents as a catalyst for innovation in the pharmaceutical sector. The event featured interactive presentations, demonstrations, and practical exercises led by experienced faculty members and industry professionals.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "In summary, the Workshop on the Use of Patent Information Systems for the Promotion of Innovation proved to be a valuable learning experience for B.Pharm students, equipping them with essential skills, knowledge, and resources to harness the power of patent information for driving innovation and making strategic decisions in the pharmaceutical sector. The event inspired students to embrace innovation, protect intellectual property, and contribute to the advancement of pharmaceutical sciences through cutting-edge research and development initiatives.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"23 September 2022"
   },
   {
    "id": "23",
     "name": "Seminar on Drug Research and Development Extracted from Plants",
     "title": "Seminar on Drug Research and Development Extracted from Plants",
     "date": "2022-08-20",
     "about": "Guru Nanak College of Pharmaceutical Sciences organized a seminar on Drug Research and Development Extracted from Plants on August 20, 2022. The seminar was conducted by Dr. R.B.P. Singh, an esteemed expert in the field. The event aimed to provide valuable insights into the significant role of plants in pharmaceutical research and development.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar on Drug Research and Development Extracted from Plants organized by Guru Nanak College of Pharmaceutical Sciences proved to be a highly informative and enriching experience for B.Pharm students. Dr. R.B.P. Singh's expertise and the interactive nature of the event contributed to its success. The seminar not only expanded participants' knowledge but also inspired them to explore the vast potential of plant-based medicine further.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"20 August 2022"
   },
   {
    "id": "22",
     "name": "Seminar on Research Areas in Pharmacy Practice",
     "title": "Seminar on Research Areas in Pharmacy Practice",
     "date": "2022-07-26",
     "about": "Guru Nanak College of Pharmaceutical Sciences organized a seminar on Research Areas in Pharmacy Practice on July 26, 2022. The seminar aimed to provide insights into various research opportunities and areas within the field of pharmacy practice, catering specifically to B.Pharm students.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar successfully broadened students' understanding of research opportunities in pharmacy practice and equipped them with valuable insights to navigate their academic and professional journeys effectively. Overall, the event served as a platform for students to explore their interests, expand their horizons, and gain inspiration for future endeavours in the pharmaceutical field.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"26 July 2022"
   },
   {
    "id": "21",
     "name": "Seminar on How to Start Own Retail Pharma Business",
     "title": "Seminar on How to Start Own Retail Pharma Business",
     "date": "2022-07-21",
     "about": "The Seminar began with stimulating discussion on the expanding opportunities within the pharmaceutical retail sector. Engaging presentations and panel discussions were conducted by seasoned entrepreneurs and faculty members. The sessions covered pivotal topics such as legal and regulatory frameworks, strategic business planning, financial management essentials, effective inventory control, customer-centric approaches, and successful case studies within the retail pharmacy domain.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Moreover, the seminar fostered an environment conducive to networking, enabling students to forge connections with industry supporters and like-minded peers. This networking opportunity facilitated the exchange of ideas, experiences, and potential collaborations, further enriching the learning experience.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"21 July 2022"
   },
   {
    "id": "20",
     "name": "Seminar on National and International Intellectual Property Rights (IPR) Policies",
     "title": "Seminar on National and International Intellectual Property Rights (IPR) Policies",
     "date": "2022-07-08",
     "about": "The Seminar on National and International Intellectual Property Rights (IPR) Policies commenced with an introductory session, where the significance of intellectual property protection in driving innovation and economic growth in the pharmaceutical sector was emphasized. The seminar featured presentations, panel discussions, and interactive sessions led by policy experts Dr. C Subramanian.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "In summary, the Seminar on National and International Intellectual Property Rights (IPR) Policies served as a platform for B. Pharm students to gain valuable insights, awareness, and practical guidance to understand and navigate intellectual property issues effectively within the pharmaceutical industry. The seminar empowered students to appreciate the importance of intellectual property protection, comply with relevant regulations, and leverage intellectual property rights strategically to drive innovation and competitiveness in the pharmaceutical sector.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"8 July 2022"
   },
   {
    "id": "19",
     "name": "Seminar on Research Opportunities in India & Abroad",
     "title": "Seminar on Research Opportunities in India & Abroad",
     "date": "2022-05-20",
     "about": "The Seminar on Research Opportunities in India & Abroad commenced with an introductory session, where the importance of research in advancing pharmaceutical sciences and contributing to scientific knowledge and innovation was emphasized. The seminar featured presentations, panel discussions, and interactive sessions led by experienced researchers, faculty members, and industry experts.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The event concluded with a closing remark, expressing gratitude to the speakers, organizers, and participants for their active involvement and contributions towards making the seminar a success. In summary, the Seminar on Research Opportunities in India & Abroad served as a platform for B. Pharm students to gain valuable insights, inspiration, and practical guidance to explore and pursue research opportunities effectively. The seminar encouraged students to consider research as a viable and rewarding career option and equipped them with the necessary information and resources to embark on their research journey.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"20 May 2022"
   },
   {
    "id": "18",
     "name": "Seminar on How to Publish Scientific Papers",
     "title": "Seminar on How to Publish Scientific Papers",
     "date": "2022-03-09",
     "about": "The Seminar on How to Publish Scientific Papers commenced with an introductory session, where the importance of scientific publishing in advancing knowledge and contributing to the scientific community was emphasized. The seminar featured presentations and interactive discussions led by experienced researchers, faculty members, and publication experts.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Students actively engaged in discussions, asked questions, and sought advice on various aspects of scientific writing and publication process. The seminar provided students with practical guidance, tips, and resources to enhance their writing skills and increase their chances of successful publication. Moreover, the seminar facilitated networking opportunities, allowing students to connect with experienced researchers, faculty members, and publication experts, as well as to share their experiences and learn from each other's insights and perspectives.The event concluded with a closing remark, expressing gratitude to the speakers, organizers, and participants for their active involvement and contributions towards making the seminar a success.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"09 March 2022"
   },
   {
    "id": "17",
     "name": "Seminar on Entrepreneurship as career Opportunity in Pharma Sector",
     "title": "Seminar on Entrepreneurship as career Opportunity in Pharma Sector",
     "date": "2021-11-22",
     "about": "The Seminar on Entrepreneurship as a Career Opportunity in the Pharma Sector commenced at 11:00 AM in the auditorium of Guru Nanak College of Pharmaceutical Sciences. The event began with an inaugural address by the college principal, highlighting the importance of entrepreneurship in driving innovation and growth within the pharmaceutical industry.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Overall, the Seminar on Entrepreneurship as a Career Opportunity in the Pharma Sector proved to be a success, achieving its objectives of educating, inspiring, and empowering B. Pharm students to consider entrepreneurship as a viable and rewarding career path. The event not only provided valuable knowledge and insights but also fostered a spirit of innovation, creativity, and entrepreneurial ambition among the next generation of pharmaceutical professionals.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"22 November 2021"
   },
   {
    "id": "16",
     "name": "Seminar on Research Methodology: Research Hypothesis & Research Proposal",
     "title": "Seminar on Research Methodology: Research Hypothesis & Research Proposal",
     "date": "2021-11-20",
     "about": "The Seminar on Research Methodology: Research Hypothesis & Research Proposal commenced at 10:30 AM in the seminar hall of Guru Nanak College of Pharmaceutical Sciences. The event began with a brief introduction by the faculty coordinator, highlighting the significance of research methodology in advancing pharmaceutical sciences and fostering evidence-based practice.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Throughout the seminar, students actively participated in discussions, asked questions, and engaged in hands-on activities to apply the concepts learned. The seminar concluded with a practical exercise where students worked in groups to formulate research hypotheses and develop draft research proposals under the guidance of faculty mentors.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"20 November 2021"
   },
   {
    "id": "15",
     "name": "Entrepreneurial Session on Communication Skill and Personality Development",
     "title": "Entrepreneurial Session on Communication Skill and Personality Development",
     "date": "2021-11-18",
     "about": "The Entrepreneurial Session on Communication Skills and Personality Development took place at 11:00 AM in the seminar hall of Guru Nanak College of Pharmaceutical Sciences. The event commenced with an opening address by the faculty coordinator, emphasizing the significance of effective communication and personality development in the entrepreneurial context and highlighting the objectives of the session.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "Feedback from participants indicated a high level of satisfaction with the content and delivery of the session, with many expressing appreciations for the practical tips, actionable strategies, and motivational insights shared by the speakers. Overall, the Entrepreneurial Session on Communication Skills and Personality Development proved to be a valuable learning experience, empowering B. Pharm students to develop the communication skills and personal attributes necessary to thrive as entrepreneurs in the pharmaceutical industry.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"18 November 2021"
   },
   {
    "id": "14",
     "name": "Seminar on Guidance on How to start Small Scale Enterprise",
     "title": "Seminar on Guidance on How to start Small Scale Enterprise",
     "date": "2021-09-16",
     "about": "The Seminar on Guidance on How to Start Small Scale Enterprise commenced with an opening address highlighting the importance of entrepreneurship and small-scale enterprises in driving innovation, economic growth, and job creation. The seminar featured presentations, panel discussions, and interactive sessions led by Mr. Saithjeet Arora and faculty members. ",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "In summary, the Seminar on Guidance on How to Start Small Scale Enterprise served as an empowering platform for B. Pharm students to gain valuable insights, inspiration, and practical guidance to pursue entrepreneurial ventures within the pharmaceutical industry. The seminar equipped students with the knowledge, skills, and confidence to embark on their entrepreneurial journey and contribute to the growth and innovation of the pharmaceutical sector through small-scale enterprises",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"16 September 2021"
   },
   {
    "id": "13",
     "name": "Research seminar on Opportunities in Pharmaceutical Manufacturing",
     "title": "Research seminar on Opportunities in Pharmaceutical Manufacturing",
     "date": "2021-08-07",
     "about": "Guru Nanak College of Pharmaceutical Sciences organized a seminar titled Opportunities in Pharmaceutical Manufacturing on August 7, 2021. The seminar aimed to enlighten B.Pharm students about the various research and career prospects available in the pharmaceutical manufacturing sector.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar successfully broadened students' understanding of career opportunities in pharmaceutical manufacturing and provided them with valuable insights to make informed decisions about their future career paths. Overall, the event served its purpose of empowering students with the knowledge and resources to pursue rewarding careers in the pharmaceutical manufacturing sector.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"07 August 2021"
   },
   {
    "id": "12",
     "name": "Research Session on Computer application in research Methodology",
     "title": "Research Session on Computer application in research Methodology",
     "date": "2021-06-23",
     "about": "The Research Session on Computer Application in Research Methodology commenced with an introductory presentation outlining the importance of incorporating technology into research methodology and highlighting the various computer applications and software tools available for research purposes. The session featured practical demonstrations, interactive tutorials, and hands-on exercises facilitated by experienced faculty members and research experts.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "In summary, the Research Session on Computer Application in Research Methodology served as a valuable learning experience for B. Pharm students, equipping them with practical skills and knowledge to leverage technology effectively in their research endeavours within the pharmaceutical sciences. The session empowered students to embrace technological advancements and enhance the quality and efficiency of their research projects.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"23 June 2021"
   },
   {
    "id": "11",
     "name": "Webinar on Importance of Regulatory Affairs in Pharmaceutical Career",
     "title": "Webinar on Importance of Regulatory Affairs in Pharmaceutical Career",
     "date": "2021-02-08",
     "about": "Kukreja Institute of Pharmaceutical Sciences organized a webinar titled Importance of Regulatory Affairs in Pharmaceutical Career on February 8, 2021. The webinar aimed to provide B.Pharm students with insights into the crucial role of regulatory affairs in the pharmaceutical industry and its significance for aspiring professionals.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The webinar successfully highlighted the critical role of regulatory affairs in the pharmaceutical industry and its significance for aspiring professionals. It equipped students with valuable information about career opportunities in regulatory affairs and provided them with insights into the skills and competencies required.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"08 February 2021"
   },
   {
    "id": "10",
     "name": "Webinar on Innovation & Research Methodology of Extracting Phytochemicals from Plants",
     "title": "Webinar on Innovation & Research Methodology of Extracting Phytochemicals from Plants",
     "date": "2020-12-30",
     "about": "On December 30, 2020, Kukreja Institute of Pharmaceutical Sciences organized a webinar on Innovation & Research Methodology of Extracting Phytochemicals from Plants for B. Pharm students. The webinar, conducted by Dr. R.B.P Singh, was held online from 10:30 am to 1:00 pm. Despite being conducted virtually, the event witnessed active participation, with more than 50 students attending, demonstrating the students' interest in learning about phytochemical extraction techniques.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The webinar conducted by Dr. R.B.P Singh at Kukreja Institute of Pharmaceutical Sciences was a successful educational initiative. It served as a platform for B. Pharm students to learn about innovative techniques and research methodologies in phytochemical extraction and gain insights into the applications of phytochemicals in pharmaceutical science. The webinar demonstrated the college's commitment to providing quality education and preparing students for careers in pharmaceutical research and development.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"30 December 2020"
   },
   {
    "id": "09",
     "name": "Research Methodology Webinar on Drug Transformation",
     "title": "Research Methodology Webinar on Drug Transformation",
     "date": "2020-09-18",
     "about": "On September 18, 2020, Guru Nanak College of Pharmaceutical Sciences hosted a Research Methodology Webinar on Drug Transformation for B.Pharm students. The webinar, conducted by Ms. Kriti Dabral, was held online from 10:30 am to 1:00 pm. Despite being conducted virtually, the event witnessed significant participation, with more than 60 students in attendance, demonstrating the students' interest in learning about research methodologies in pharmaceutical science.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Research Methodology Webinar on Drug Transformation conducted by Ms. Yashika Uniyal at Kukreja Institute of Pharmaceutical Sciences was a successful educational initiative. Despite being conducted online, the webinar effectively engaged students and provided them with valuable knowledge and insights into research methodologies in pharmaceutical science. The webinar underscored the college's commitment to providing quality education and preparing students for careers in pharmaceutical research and development.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"18 September 2020"
   },
   {
    "id": "08",
     "name": "Seminar on Early Stage Entrepreneurship for Pharma Students",
     "title": "Seminar on Early Stage Entrepreneurship for Pharma Students",
     "date": "2020-04-27",
     "about": "On April 27, 2020, Kukreja Institute of Pharmaceutical Sciences organized a Seminar on Early Stage Entrepreneurship for B.Pharm students. The seminar, conducted by Ms. Kriti Dabral, commenced at 10:30 am and concluded at 1:00 pm. The event attracted a large audience, with over 100 students in attendance, indicating a significant interest among students in exploring entrepreneurial opportunities in the pharmaceutical industry.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar on Early-Stage Entrepreneurship conducted by Ms. Kriti Dabral at Guru Nanak College of Pharmaceutical Sciences was a well-received and informative event. It served as a platform for B.Pharm students to learn about early-stage entrepreneurship in the pharmaceutical industry and inspired them to consider entrepreneurial careers. The seminar highlighted the college's commitment to nurturing entrepreneurship and innovation among its students.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"27 April 2020"
   },
   {
    "id": "07",
     "name": "Seminar for Pharmacy Students on Converting Innovation into Entrepreneurship",
     "title": "Seminar for Pharmacy Students on Converting Innovation into Entrepreneurship",
     "date": "2020-02-01",
     "about": "On February 1, 2020, Kukreja Institute of Pharmaceutical Sciences hosted a Seminar for Pharmacy Students on Converting Innovation into Entrepreneurship, organized by Mr. Saithjeet Arora. The event commenced at 10:30 am in the college auditorium and lasted until 1:00 pm. It witnessed active participation from students, faculty members, and industry professionals alike.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar for Pharmacy Students on Converting Innovation into Entrepreneurship, systematized by Mr. Saithjeet Arora at Kukreja Institute of Pharmaceutical Sciences, was a resounding success. It provided a platform for students to learn from industry experts, gain practical knowledge, and explore entrepreneurial opportunities in the pharmaceutical sector. The event underscored the college's commitment to nurturing entrepreneurial talent and fostering innovation-driven initiatives among its students.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"01 February 2020"
   },
   {
    "id": "06",
     "name": "Research Seminar on Pharmacy Career in Regulatory Affairs",
     "title": "Research Seminar on Pharmacy Career in Regulatory Affairs",
     "date": "2019-11-09",
     "about": "The Research Seminar on Pharmacy Career in Regulatory Affairs commenced at 11:00 AM in the seminar hall of Kukreja Institute of Pharmaceutical Sciences. The event began with an introductory address by the faculty coordinator, outlining the objectives of the seminar and highlighting the significance of regulatory affairs in the pharmaceutical sector.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar concluded with a panel discussion and Q&A session, allowing students to interact with the speakers and seek further clarification on various aspects of regulatory affairs careers. Students expressed their appreciation for the valuable insights gained from the seminar, with many indicating interest in pursuing careers in regulatory affairs and exploring opportunities in this dynamic and vital sector of the pharmaceutical industry.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"09 November 2019"
   },
   {
    "id": "05",
     "name": "Research Seminar on Advances in Pharmaceutical Analysis",
     "title": "Research Seminar on Advances in Pharmaceutical Analysis",
     "date": "2019-11-08",
     "about": "The Research Seminar on Advances in Pharmaceutical Analysis commenced at 11:30 AM in the seminar hall of Kukreja Institute of Pharmaceutical Sciences. The event began with an opening address by the faculty coordinator, outlining the objectives of the seminar and highlighting the importance of pharmaceutical analysis in ensuring the safety, efficiency, and quality of pharmaceutical products.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar concluded with a panel discussion and interactive Q&A session, allowing students to engage with the speakers, ask questions, and discuss key insights and challenges in pharmaceutical analysis. Attendees expressed their appreciation for the valuable knowledge and insights gained from the seminar, with many indicating interest in pursuing further studies or careers in pharmaceutical analysis and research.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"08 November 2019"
   },
   {
    "id": "04",
     "name": "Seminar on Medical research and writing",
     "title": "Seminar on Medical research and writing",
     "date": "2019-11-07",
     "about": "The Seminar on Medical Research and Writing commenced at 11:00 AM in the seminar hall of Kukreja Institute of Pharmaceutical Sciences. The event began with an introductory address by the faculty coordinator, outlining the objectives of the seminar and emphasizing the importance of medical research and scientific writing in advancing pharmaceutical sciences and healthcare",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar concluded with a hands-on workshop on medical writing, where students had the opportunity to practice writing abstracts, research articles, and other scientific documents under the guidance of experienced mentors. Attendees actively participated in discussions, asked questions, and engaged in interactive exercises throughout the seminar.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"07 November 2019"
   },
   {
    "id": "03",
     "name": "Seminar on proficiency in Scientific Writing",
     "title": "Seminar on proficiency in Scientific Writing",
     "date": "2019-08-12",
     "about": "The Seminar on Proficiency in Scientific Writing commenced at 11:30 AM in the seminar hall of Kukreja Institute of Pharmaceutical Sciences. The event began with an opening address by the faculty coordinator, highlighting the objectives of the seminar and emphasizing the importance of scientific writing skills in academic and professional settings.",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar concluded with a hands-on workshop on scientific writing, where students had the opportunity to practice writing abstracts and research articles under the guidance of experienced mentors. Students actively participated in discussions, asked questions, and engaged in interactive exercises throughout the seminar.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"12 August 2019"
   },
   {
    "id": "02",
     "name": "Pharma Seminar on IPR and Patent Laws",
     "title": "Pharma Seminar on IPR and Patent Laws",
     "date": "2019-08-10",
     "about": "On August 10, 2019, Kukreja Institute of Pharmaceutical Sciences organized a Seminar on Intellectual Property Rights (IPR) and Patent Laws for B. Pharm students. The event was conducted by Mr. Ankur Jaiswal and took place from 11:30 am to 1:00 pm. Over 60 students attended the seminar, demonstrating significant interest in the subject matter",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The Seminar on Intellectual Property Rights (IPR) and Patent Laws conducted by Mr. Ankur Jaiswal at Kukreja Institute of Pharmaceutical Sciences was a valuable educational initiative for B. Pharm students. It served as a platform for students to enhance their understanding of IPR fundamentals and patent laws, thereby preparing them to contribute effectively to the innovation-driven pharmaceutical sector.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"10 August 2019"
   },
   {
    "id": "01",
     "name": "Seminar on IPR and patent filing",
     "title": "Seminar on IPR and patent filing",
     "date": "2019-03-02",
     "about": "The Seminar on IPR and Patent Filing commenced at 11:30 AM in the seminar hall of Kukreja Institute of Pharmaceutical Sciences. The event began with an introductory address by the faculty coordinator, highlighting the objectives of the seminar and emphasizing the importance of intellectual property protection for pharmaceutical innovations",
     "image": "",
     "image2": "",
     "image3": "",
     "category": "",
     "description": "The seminar concluded with a Q&A session, allowing students to seek further clarification on specific topics and share their insights and experiences. Feedback from participants indicated a high level of satisfaction with the content and delivery of the seminar, with many expressing appreciations for the practical insights, actionable tips, and real-world examples shared by the speakers.",
     "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
     "eventdate":"02 March 2019"
   }
]