[
  {
    "id": "54",
    "name": "Techno Jashan: A Vibrant Celebration of Talent and Creativity",
    "title": "Techno Jashan: A Vibrant Celebration of Talent and Creativity",
    "date": "2024-04-30",
    "about": "Techno Jashan, a cultural extravaganza organized by Guru Nanak College Dehradun, kicked off with a burst of enthusiasm and talent on its first day. The event, held on the 1st of June, 2024, was a melting pot of creativity, showcasing the diverse talents of the college's students.",
    "image": "assets/images/events/gnc-events-dance-img.webp",
    "image2": "assets/images/events/gnc-events-tchno-img1.webp",
    "image3": "assets/images/events/gnc-events-technoimgs4.webp",
    "category": "Educational",
    "description": "The day started with electrifying dance performances that set the stage on fire. From classical to contemporary, the dancers mesmerized the audience with their skill and passion. The music lovers were treated to soulful singing performances that touched the heart and uplifted the spirit. Adding to the excitement were the captivating fashion walks, where students strutted down the runway with style and confidence. The fashion show was a visual delight, highlighting the creativity and flair of the budding designers. Throughout the day, the atmosphere was filled with energy and excitement, as students and audience members alike were swept away by the talent on display. Whether you're a music lover, a fashion enthusiast, or simply looking for some entertainment, Techno Jashan had something for everyone. As the event unfolds over the coming days, we can expect more unforgettable moments that celebrate the talent and creativity of Guru Nanak College Dehradun's students. Stay tuned for more updates and get ready to be amazed!",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "30 April 2024"
  },
  {
    "id": "53",
    "name": "Inter-College Competition",
    "title": "Inter-College Competition",
    "date": "2024-04-29",
    "about": " the Guru Nanak College of Pharmaceutical Sciences hosted an exhilarating Inter-College Competition, bringing together talented students from various institutions to showcase their skills and creativity. The college campus buzzed with excitement as participants gathered to compete in a wide range of events spanning academic, cultural, and sports disciplines.",
    "image": "assets/images/events/gnc-events-technoimg1.webp",
    "image2": "assets/images/events/gnc-events-techoimg2.webp",
    "image3": "assets/images/events/gnc-events-technoimg3.webp",
    "category": "Sports",
    "description": "The competition featured academic quizzes, debates, and poster presentations, allowing students to demonstrate their knowledge and expertise in their respective fields. Cultural events such as music performances, dance competitions, and art exhibitions added vibrancy to the atmosphere, showcasing the diverse talents of the participants. Sports enthusiasts engaged in friendly matches of cricket, football, and volleyball, fostering camaraderie and sportsmanship. Faculty members and industry professionals served as judges and mentors, providing guidance and encouragement to the participants. The Inter-College Competition was a celebration of talent, creativity, and teamwork, highlighting the spirit of excellence and collaboration that thrives within the academic community.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "29 April 2024"
  },
  {
    "id": "52",
    "name": "Visit to Parliament of India",
    "title": "Students Experience the Pulse of Indian Democracy",
    "date": "2024-04-26",
    "about": "The Guru Nanak College of Pharmaceutical Sciences organized an enlightening visit to the Indian Parliament for its scholars on the 26th of April, 2024. This visit aimed to immerse students in the essence of governance and legislative discourse, thereby recognizing the importance of civic engagement in their holistic development. Nearly all the students from Pharmaceutical department participated in this unique experience.",
    "image": "assets/images/events/gnc-image-events2.webp",
    "image2": "assets/images/events/gnc-image-events1.webp",
    "image3": "assets/images/events/gnc-image-events3.webp",
    "category": "Educational",
    "description": "The event was graced by the presence of Mrs. Vineet Arora – COO, Guru Nanak College of Pharmaceutical Sciences. Along with the chief guest, faculty members from Pharmaceutical department were also present to support the students. The visit was designed to ignite a passion for active citizenship and provide firsthand experience of India's democratic processes. The event received positive feedback from both students and faculty members, with many expressing their appreciation for the college's efforts to organize such a captivating and educational visit. Overall, the Parliament visit served its purpose of fostering a sense of civic responsibility and engagement within the college community. In conclusion, this visit was a memorable and inspiring experience for all participants, contributing to their overall understanding of and commitment to active citizenship.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "26 April 2024"
  },
  {
    "id": "50",
    "name": "Colors of Unity: Pre-Holi Celebration",
    "title": "Colors of Unity: Pre-Holi Celebration",
    "date": "2024-03-24",
    "about": "On 23-03-2024, Guru Nanak College in Dehradun came alive with the vibrant colors of Holi as students and faculty joined together for a joyous pre-Holi celebration. The campus was transformed into a kaleidoscope of hues, echoing with laughter, showcasing the unity and spirit of the college community.",
    "image": "assets/images/events/gnc-events-holiimg.webp",
    "image2": "assets/images/events/gnc-events-holiimg1.webp",
    "image3": "assets/images/events/gnc-events-holiimg2.webp",
    "category": "cultural",
    "description": "The event was a true reflection of the college's ethos, where diversity is celebrated, and bonds are strengthened through shared experiences. Students and faculty alike participated in the festivities with great enthusiasm, embracing the joyous atmosphere and spreading the message of harmony and togetherness. From traditional music and dance performances to colorful rangoli and food stalls, every aspect of the celebration was meticulously planned to ensure a memorable experience for everyone. Students had the opportunity to not only enjoy the festivities but also learn about the cultural significance of Holi and its importance in Indian tradition. The highlight of the event was the spirit of inclusivity and unity that permeated throughout the campus. Regardless of background or beliefs, everyone came together as one big family, united by the joyous spirit of Holi. In conclusion, the pre-Holi celebration at Guru Nanak College was a resounding success, showcasing the rich cultural heritage of India and fostering a sense of unity and togetherness among the college community. It was a day filled with joy, laughter, and colorful memories that will be cherished for years to come.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "24 March 2024"
  },
  {
    "id": "49",
    "name": "National Workshop",
    "title": "National Workshop",
    "date": "2024-03-14",
    "about": "the Guru Nanak College of Pharmaceutical Sciences hosted a National Workshop  on the 14th of march that brought together scholars, industry experts, and students for a day of intensive learning and collaboration. The workshop focused on recent advancements in pharmaceutical sciences and their applications. The college campus was bustling with activity as participants from various institutions gathered to exchange knowledge and ideas.",
    "image": "assets/images/events/gnc-events-workshopimg.webp",
    "image2": "assets/images/events/gnc-events-workshopimg1.webp",
    "image3": "assets/images/events/gnc-events-workshopimg2.webp",
    "category": "Educational",
    "description": "The event featured keynote addresses by prominent researchers, interactive sessions, and hands-on demonstrations of cutting-edge technologies. Workshops were conducted on topics such as drug development, biotechnology, and regulatory affairs, providing attendees with valuable insights and practical skills. Poster presentations and networking sessions allowed students to showcase their research and connect with professionals in their field. Nearly all students from the Pharmaceutical department participated, reflecting their eagerness to engage with the latest developments in their discipline. The National Workshop was a tremendous success, fostering a collaborative environment that encouraged innovation, professional growth, and a deeper understanding of pharmaceutical sciences.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "14 March 2024"
  },
  {
    "id": "48",
    "name": "World Glaucoma week",
    "title": "World Glaucoma week",
    "date": "2024-03-10",
    "about": "The Guru Nanak College of Pharmaceutical Sciences organized an enlightening visit to the Indian Parliament for its scholars on the 10th of March, 2024. This visit aimed to immerse students in the essence of governance and legislative discourse, thereby recognizing the importance of civic engagement in their holistic development. Nearly all the students from Pharmaceutical department participated in this unique experience.",
    "image": "assets/images/events/gnc-events-glacuoma-img.webp",
    "image2": "assets/images/events/gnc-events-glacuoma-img1.webp",
    "image3": "assets/images/events/gnc-events-glacuoma-img2.webp",
    "category": "Educational",
    "description": "The event was graced by the presence of Mrs. Vineet Arora – COO, Guru Nanak College of Pharmaceutical Sciences. Along with the chief guest, faculty members from Pharmaceutical department were also present to support the students. The visit was designed to ignite a passion for active citizenship and provide firsthand experience of India's democratic processes. The event received positive feedback from both students and faculty members, with many expressing their appreciation for the college's efforts to organize such a captivating and educational visit. Overall, the Parliament visit served its purpose of fostering a sense of civic responsibility and engagement within the college community. In conclusion, this visit was a memorable and inspiring experience for all participants, contributing to their overall understanding of and commitment to active citizenship.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "10 March 2024"
  },
  {
    "id": "47",
    "name": "Women's Day Celebration",
    "title": "Women's Day Celebration",
    "date": "2024-03-08",
    "about": "the Guru Nanak College of Pharmaceutical Sciences celebrated International Women’s Day On the 8th of March with great enthusiasm and reverence. The event was dedicated to honoring the achievements and contributions of women in various fields. The college campus was adorned with banners and posters highlighting the theme of gender equality and women's empowerment.",
    "image": "assets/images/events/gnc-events-womencele-img.webp",
    "image2": "assets/images/events/gnc-events-womencele-img1.webp",
    "image3": "assets/images/events/gnc-events-womencele-img2.webp",
    "category": "cultural",
    "description": " The celebration began with an inspiring keynote speech by a renowned female leader, emphasizing the importance of women's rights and equality. This was followed by a series of activities, including panel discussions, workshops on women’s health and career development, and cultural performances showcasing the talents of female students. An exhibition was also organized, displaying the accomplishments of women scientists, entrepreneurs, and leaders. Nearly all students, along with faculty members, participated actively, reflecting the collective commitment to fostering an inclusive and supportive environment. The Women’s Day celebration was a resounding success, reinforcing the values of respect, equality, and empowerment, and contributing to the holistic development of students by promoting awareness and appreciation of gender issues.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "08 March 2024"
  },
  {
    "id": "46",
    "name": "Science Exhibition",
    "title": "Science Exhibition",
    "date": "2024-02-28",
    "about": "On the 26th of April, the Guru Nanak College of Pharmaceutical Sciences hosted a dynamic Science Exhibition, showcasing the innovative spirit and scientific curiosity of its students. The college campus was abuzz with excitement as students from the Pharmaceutical department and other disciplines presented their research projects and experiments.",
    "image": "assets/images/events/gnc-events-scienceexibition-img.webp",
    "image2": "assets/images/events/gnc-events-scienceexibition-img1.webp",
    "image3": "assets/images/events/gnc-events-scienceexibition-img2.webp",
    "category": "Educational",
    "description": "The exhibition featured a diverse range of displays, including cutting-edge pharmaceutical research, sustainable energy solutions, and advanced medical technologies. Faculty members and industry experts evaluated the projects, providing valuable feedback and encouragement to the young scientists. Interactive sessions and live demonstrations captivated the audience, highlighting the practical applications of scientific principles. This event not only provided a platform for students to exhibit their work but also fostered a collaborative environment for the exchange and development of ideas. Nearly all students from the Pharmaceutical department participated, demonstrating their commitment to scientific inquiry and innovation. The Science Exhibition was a resounding success, inspiring students to pursue excellence in their fields and contributing to their holistic development through experiential learning.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "28 February 2024"
  },
  {
    "id": "44",
    "name": "Happy Republic Day",
    "title": "Happy Republic Day",
    "date": "2024-01-26",
    "about": "On the 26th of January, 2024, the Guru Nanak College of Pharmaceutical Sciences celebrated Republic Day with immense pride and patriotic fervor. The college campus was adorned with the tricolor decorations, and the air resonated with patriotic songs. The event commenced with the hoisting of the national flag, followed by the singing of the national anthem, evoking a sense of unity and national pride.",
    "image": "assets/images/events/gnc-events-republicimg1.webp",
    "image2": "assets/images/events/gnc-events-republicimg3.webp",
    "image3": "assets/images/events/gnc-events-republicimg2.webp",
    "category": "cultural",
    "description": "The celebration featured inspiring speeches by faculty members, highlighting the importance of the day and the values enshrined in the Constitution. Students showcased their talents through cultural performances, including traditional dances and patriotic songs, emphasizing the diversity and unity of the nation. Additionally, a special exhibition was organized, displaying projects and artworks created by students that depicted India's rich heritage and achievements. Nearly all students from the Pharmaceutical department participated, reflecting their respect for the nation and their commitment to civic engagement. The Republic Day celebration was a profound reminder of the importance of democracy, freedom, and responsibility, instilling a sense of national pride and unity among the students.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "26 January 2024"
  },
  {
    "id": "43",
    "name": "Happy Lohri",
    "title": "Happy Lohri",
    "date": "2024-01-14",
    "about": "On the 14th of January, 2024, the Guru Nanak College of Pharmaceutical Sciences celebrated Lohri with vibrant enthusiasm and cultural richness. The college courtyard was transformed into a festive arena, beautifully decorated with traditional Punjabi motifs and filled with the joyous sounds of folk music. Central to the celebration was the lighting of a grand bonfire, around which students gathered to offer peanuts, popcorn, sesame seeds, and jaggery, symbolizing gratitude and the end of winter.",
    "image": "assets/images/events/gnc-events-lohriimg1.webp",
    "image2": "assets/images/events/gnc-events-lohriimg3.webp",
    "image3": "assets/images/events/gnc-events-lohriimg2.webp",
    "category": "cultural",
    "description": "The event was marked by lively Bhangra and Gidda performances, accompanied by the rhythmic beats of the dhol, which enlivened the atmosphere and encouraged everyone to participate. Traditional Punjabi delicacies such as makki di roti and sarson da saag were served, enhancing the festive spirit with authentic flavors. Stories and legends, including the tale of Dulla Bhatti, were shared, enriching the cultural experience and connecting students with the festival's historical significance. Nearly all students from the Pharmaceutical department took part, fostering a sense of unity and cultural appreciation. The Lohri celebration was a memorable event, highlighting the importance of cultural traditions in enriching student life and contributing to their holistic development.",
    "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
    "eventdate": "14 January 2024"
  },
    {
      "id": "47 ",
      "name": "Rangreza 2023",
      "title": "Rangreza 2023",
      "date": "2023-10-28",
      "about": "Guru Nanak College of Pharmaceutical Sciences hosted its annual college fest, Rangreza, from 28-10-2023 to 29-10-2023. The event aimed to provide a platform for students to showcase their talents, creativity, and enthusiasm while fostering a sense of community and camaraderie among the student body.",
      "image": "assets/images/events/1.webp",
      "category": "cultural",
      "description": "A special highlight of the event was the presence of a celebrity guest, who interacted with the students, shared anecdotes from their career journey, and inspired them to pursue their dreams with passion and dedication. Rangreza - College Fest 2023 was a resounding success, bringing together students, faculty, and staff in a celebration of talent, creativity, and community spirit. The event provided a platform for students to showcase their skills, learn from experts, and forge lasting friendships and memories.",
      "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
      "eventdate": "28 October 2023 & 29 October 2023"
    },
     {
      "id": "46",
       "name": "Dusshera 2023",
       "title": "Dusshera 2023",
       "date": "2023-10-23",
       "about": "On the auspicious occasion of Dussehra, celebrated on 23rd October 2023, the campus of Guru Nanak College of Pharmaceutical Sciences resonated with joyous festivities and traditional fervor. Dussehra, also known as Vijayadashami, marks the victory of good over evil and is celebrated with great enthusiasm across India.",
       "image": "assets/images/events/2.webp",
      
       "category": "cultural",
       "description": "Cultural programs and performances enriched the festive atmosphere, showcasing vibrant dances, melodious music, and theatrical presentations that depicted mythological stories associated with Dussehra. Students enthusiastically participated in these events, displaying their talents and creativity while reinforcing cultural values.A highlight of the event was the distribution of prasad among the attendees, fostering a sense of unity and communal harmony among students, faculty, and staff. The spirit of Dussehra, characterized by joy, positivity, and the spirit of unity, permeated throughout the celebration.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"23 October 2023"
     },
     {
      "id": "45",
       "name": "Poster Presentation",
       "title": "Poster Presentation",
       "date": "2023-08-25",
       "about": "On August 25, 2023, Guru Nanak College of Pharmaceutical Sciences organized a Poster Presentation Event, providing a platform for students to showcase their innovative projects. The event aimed to foster academic excellence, and promote scholarly communication among students and faculty members.",
       "image": "assets/images/events/3.webp",
      
       "category": "",
       "description": "Outstanding poster presentations were recognized and awarded based on merit and innovation. Participants who demonstrated exceptional research skills, creativity, and scientific consistency were acknowledged for their contributions. Certificates were presented to winners during a closing ceremony, honouring their achievements and inspiring others to pursue excellence in research.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"25 August 2023"
     },
     {
      "id": "44",
       "name": "Hospital Visit 2023 - CMI",
       "title": "Hospital Visit 2023 - CMI",
       "date": "2023-08-17",
       "about": "The visit to CMI Hospital organized by the Pharmacy Department of Guru Nanak College of Pharmaceutical Sciences on August 17, 2023, was a valuable learning experience for students, providing them with first-hand exposure to hospital pharmacy practices and interdisciplinary healthcare collaboration. It allowed students to gain practical insights into the role of pharmacists in patient care and medication management within a clinical setting, further enriching their education and preparing them for future careers in pharmacy practice.",
       "image": "assets/images/events/4.webp",
      
       "category": "",
       "description": "The objective of the CMI Hospital Visit organized by Guru Nanak College of Pharmaceutical Sciences is to provide students with a practical understanding of the healthcare system and pharmaceutical practices within a hospital setting. Through this visit, students will gain insights into various aspects of patient care, pharmacy management, and the role of pharmacists in a clinical setting. Additionally, the event aims to foster networking opportunities between students and professionals in the healthcare industry, encouraging collaboration and learning beyond the classroom.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"17 August 2023"
     },
     {
      "id": "43",
       "name": "Dengue awareness Rally",
       "title": "Dengue awareness Rally",
       "date": "2023-08-01",
       "about": "The Dengue Awareness Rally organized by NSS section of Guru Nanak College of Pharmaceutical Sciences in Jhajra was a commendable initiative aimed at raising awareness about dengue fever and promoting preventive measures. Through the rally, participants effectively disseminated information to the community, empowering them to take proactive steps to prevent the spread of dengue. The event exemplified the college's commitment to community health and disease prevention, and it highlighted the importance of collective action in combating public health challenges like dengue fever.",
       "image": "assets/images/events/5.webp",
      
       "category": "",
       "description": "The objective of the Dengue awareness rally organized by Guru Nanak College of Pharmaceutical Sciences on 1-08-2023 is to educate the community about the prevention, symptoms, and treatment of dengue fever. The rally aims to raise awareness about the importance of eliminating mosquito breeding sites and promoting preventive measures to reduce the incidence of dengue infections in the local area.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"01 August 2023"
     },
     {
      "id": "42",
       "name": "Farewell 2023",
       "title": "Farewell 2023",
       "date": "2023-06-24",
       "about": "The Farewell 2023 event organized by Guru Nanak College of Pharmaceutical Sciences was a memorable occasion filled with nostalgia, laughter, and heartfelt goodbyes. It marked the culmination of the academic journey for the graduating batch of students, as they bid adieu to their alma mater and prepared to embark on new chapters of their lives.",
       "image": "assets/images/events/6.webp",
      
       "category": "cultural",
       "description": "The highlight of the event was the emotional farewell address by the graduating students, as they expressed their heartfelt gratitude to the college, faculty, and peers for shaping their academic and personal growth. There were moments of laughter and tears as they reminisced about their experiences and cherished moments spent together.Mementos and Tokens: As a token of appreciation and remembrance, mementos and personalized gifts were presented to the graduating students, symbolizing the enduring bond between them and their alma mater.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"24 June 2023"
     },
     {
      "id": "41",
       "name": "Yoga Day 2023",
       "title": "Yoga Day 2023",
       "date": "2023-06-21",
       "about": "Yoga Day 2023 was celebrated with great fervour and enthusiasm at Guru Nanak College of Pharmaceutical Sciences on June 21, 2023. The event aimed to promote the ancient practice of yoga and its numerous benefits for physical, mental, and spiritual well-being.The event commenced with invigorating yoga sessions led by experienced instructors. Participants engaged in various yoga asanas (postures) and pranayama (breathing exercises) to rejuvenate their mind and body.",
       "image": "assets/images/events/7.webp",
      
       "category": "",
       "description": "Yoga Day 2023 at Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering a deeper understanding and appreciation for yoga as a holistic practice for physical, mental, and spiritual well-being. The event served as a reminder of the timeless wisdom of yoga and its relevance in the modern world.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"21 June 2023"
     },
     {
      "id": "40",
       "name": "Red Cross Day celebration - Rangoli competition",
       "title": "Red Cross Day celebration - Rangoli competition",
       "date": "2023-05-08",
       "about": "The NSS team of Guru Nanak College of Pharmaceutical Sciences organized a vibrant celebration on the occasion of Red Cross Day, featuring a Rangoli Competition. The event aimed to raise awareness about the humanitarian activities of the Red Cross and promote artistic expression among students.The event commenced at 9:00 AM in the college auditorium, where students, faculty, and staff gathered with enthusiasm. The organizing committee had meticulously planned the competition, ensuring maximum participation and creativity.",
       "image": "assets/images/events/8.webp",
      
       "category": "cultural",
       "description": "Rangoli Competition at Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering a spirit of creativity, compassion, and community engagement. Through artistic expression and meaningful discourse, the event underscored the importance of humanitarian values in today's world.The college extends its gratitude to all participants, judges, guests, and organizers for their invaluable contributions to making the event a memorable affair. Such initiatives not only enrich the college experience but also instill a sense of social responsibility and empathy among students, preparing them to be conscientious global citizens.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"08 May 2023"
     },
     {
      "id": "39",
       "name": "Earth Day 2023",
       "title": "Earth Day 2023",
       "date": "2023-04-22",
       "about": "Guru Nanak College of Pharmaceutical Sciences, committed to fostering a sense of environmental responsibility among its students and faculty, celebrated Earth Day on April 22, 2023. This annual event was conducted under the college’s NSS team and was aimed to raise awareness about pressing environmental issues and promote sustainable practices within the college community.",
       "image": "assets/images/events/9.webp",
      
       "category": "",
       "description": "Earth Day 2023 at Guru Nanak College of Pharmaceutical Sciences was a momentous occasion that brought together the college community in a shared commitment to environmental sustainability. Through a diverse range of activities, participants gained valuable knowledge, skills, and inspiration to become proactive stewards of the planet. As we reflect on the success of this event, let us continue to implement positive changes in our daily lives and work towards a more sustainable and resilient future for generations to come.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"22 April 2023"
     },
     {
      "id": "38",
       "name": "Pharmacy Department Students' Visit to Kailash Hospital, Dehradun",
       "title": "Pharmacy Department Students' Visit to Kailash Hospital, Dehradun",
       "date": "2023-03-27",
       "about": "On 27th March 2023, a group of twenty-five pharmacy students along with two faculty members embarked on an educational trip to Kailash Hospital, Dehradun. The trip commenced at 9:00 AM with students eagerly awaiting the opportunity to explore the practical applications of their theoretical knowledge. The visit to Kailash Hospital, Dehradun, by the students of the Pharmacy Department from Guru Nanak College of Pharmaceutical Sciences aimed to provide them with practical exposure to hospital pharmacy practices, enhance their understanding of pharmaceutical services in a clinical setting, and foster professional development. Upon arrival at Kailash Hospital, the students were warmly welcomed by the hospital staff, including the pharmacy department personnel. The itinerary included a series of informative sessions and interactive workshops tailored to broaden the students' understanding of hospital pharmacy operations.",
       "image": "assets/images/events/10.webp",
      
       "category": "",
       "description": "Introduction to Hospital Pharmacy: The students received an insightful introduction to the role and significance of pharmacy services within a hospital setting. They learned about the various functions of a hospital pharmacy, including drug procurement, inventory management, and dispensing procedures. Hospital Tour: A guided tour of the hospital facilities provided students with first-hand exposure to different pharmacy units, such as inpatient pharmacy, outpatient pharmacy, and central pharmacy. They observed how medications are stored, dispensed, and managed in compliance with regulatory standards. Clinical Pharmacy Practices: Students had the opportunity to shadow clinical pharmacists during patient rounds and medication counselling sessions. This hands-on experience allowed them to witness the crucial role of pharmacists in optimizing medication therapy and promoting patient safety. Interactive Sessions: Engaging discussions with hospital pharmacists facilitated the exchange of knowledge and insights into emerging trends and challenges in the field of pharmacy practice. Topics such as medication reconciliation, medication therapy management, and pharmacovigilance were explored in depth.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"27 March 2023"
     },
     {
      "id": "38",
       "name": "Industrial Visit Himalayan Drug Company 2023",
       "title": "Industrial Visit Himalayan Drug Company 2023",
       "date": "2023-03-26",
       "about": "On 26th March 2023, Guru Nanak College of Pharmaceutical Sciences organized an industrial visit to the Himalayan Drug Company located in Dehradun. The visit aimed to provide students with practical insights into the pharmaceutical manufacturing processes and operations.The industrial visit was attended by 50 number of students and 4 faculty members from Guru Nanak College of Pharmaceutical Sciences.",
       "image": "assets/images/events/11.webp",
      
       "category": "",
       "description": "The industrial visit to the Himalayan Drug Company was an enriching experience for the students of Guru Nanak College of Pharmaceutical Sciences. It provided them with valuable exposure to real-world pharmaceutical operations and enhanced their understanding of the industry. The college expresses its gratitude to the management and staff of the Himalayan Drug Company for their hospitality and for facilitating a memorable learning experience.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 March 2023"
     },
     {
      "id": "37",
       "name": "Janaushadhi Mission 2023",
       "title": "Janaushadhi Mission 2023",
       "date": "2023-03-07",
       "about": "On the 7th of March 2023, Guru Nanak College of Pharmaceutical Sciences hosted the Janaushadhi Mission 2023 event. The mission aimed to promote affordable healthcare and raise awareness about the benefits of generic medicines among the masses.",
       "image": "assets/images/events/13.webp",
      
       "category": "",
       "description": "The Janaushadhi Mission 2023 event organized by Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering awareness and understanding of generic medicines among attendees. The event underscored the importance of collaborative efforts in ensuring affordable and accessible healthcare for all segments of society. Through such initiatives, the mission to make quality healthcare affordable and accessible to every citizen of the country can be realized.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"07 March 2023"
     },
     {
      "id": "36",
       "name": "Holi Milan Smaroh, 2023",
       "title": "Holi Milan Smaroh, 2023",
       "date": "2023-03-06",
       "about": "Guru Nanak College of Pharmaceutical Sciences organized a vibrant and joyous event, Holi Milan Smaroh, 2023, on March 6th, 2023, to celebrate the festival of colors, Holi. The event aimed to foster a sense of unity, harmony, and cultural exchange among the students, faculty, and staff of the institution.",
       "image": "assets/images/events/14.webp",
      
       "category": "",
       "description": "Holi Milan Smaroh provided an excellent platform for fostering a sense of community and togetherness among the students, faculty, and staff. It offered an opportunity for everyone to come together, celebrate diversity, and strengthen bonds of friendship and unity.Delicious traditional Holi delicacies were served, adding flavor to the celebrations. Mouth-watering sweets like gujiya, thandai, and other festive treats were enjoyed by all, enhancing the culinary experience of the event.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"06 March 2023"
     },
     {
      "id": "35",
       "name": "India’s 74th Republic Day celebration",
       "title": "India’s 74th Republic Day celebration",
       "date": "2023-01-26",
       "about": "Guru Nanak College of Pharmaceutical Sciences celebrated India’s 74th Republic Day with great fervor and patriotism. The event aimed to instill a sense of national pride and unity among students and faculty members.",
       "image": "assets/images/events/15.webp",
      
       "category": "",
       "description": "The 74th Republic Day celebration at Guru Nanak College of Pharmaceutical Sciences was a resounding success, fostering a sense of pride, unity, and patriotism among the attendees. The event not only commemorated the historic occasion but also inspired the youth to contribute positively to the development and progress of the nation.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 January 2023"
     },
     {
      "id": "34",
       "name": "Guest Lecture COE UTU",
       "title": "Guest Lecture COE UTU",
       "date": "2023-01-06",
       "about": "On January 6, 2023, Guru Nanak College of Pharmaceutical Sciences, Dehradun, organized a motivational guest lecture. The event aimed to inspire and motivate students to pursue excellence in their academic and professional endeavors.Dr. V.K Patel emphasized the importance of setting ambitious yet achievable goals and maintaining persistence in the face of challenges. He shared personal anecdotes and success stories to illustrate how determination and perseverance can lead to remarkable achievements.",
       "image": "assets/images/events/34.webp",
      
       "category": "",
       "description": "Dr. V.K Patel provided personalized guidance and advice, addressing students' concerns and offering motivational insights tailored to their aspirations and challenges.The motivational guest lecture received overwhelmingly positive feedback from attendees, who expressed gratitude for the inspiring and empowering experience. Many students reported feeling motivated and energized to pursue their goals with renewed vigor and determination.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"06 January 2023"
     },
     {
      "id": "33",
       "name": "Seminar on Research on Evidence-Based Medicine",
       "title": "Seminar on Research on Evidence-Based Medicine",
       "date": "2023-01-05",
       "about": "The Seminar on the Importance of Research on Evidence-Based Medicine, hosted by Guru Nanak College of Pharmaceutical Sciences on January 5th, 2023, served as a pivotal platform for delving into the critical nexus between research endeavors and the practice of evidence-based medicine (EBM). Bringing together a diverse array of participants, including esteemed speakers, researchers, healthcare professionals, and students, the event sought to elucidate the profound impact of research on shaping the landscape of modern healthcare.",
       "image": "assets/images/events/16.webp",
      
       "category": "",
       "description": "In conclusion, the Seminar on the Importance of Research on Evidence-Based Medicine served as a beacon of enlightenment, illuminating the path toward evidence-driven healthcare delivery. As we reflect on the insights garnered and lessons learned, it behooves us to redouble our efforts in promoting a culture of research excellence, fostering interdisciplinary collaboration, and leveraging cutting-edge technologies to advance the frontiers of evidence-based medicine.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"05 January 2023"
     },
     {
      "id": "32",
       "name": "International Conference 2022",
       "title": "International Conference 2022",
       "date": "2022-11-26",
       "about": "The International Conference 2022, organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, served as a prominent platform for scholars, researchers, academicians, and industry professionals to exchange ideas, share insights, and discuss the latest advancements in the field of pharmaceutical sciences. Held on November 26, 2022, the event garnered widespread participation and attention from across the globe.",
       "image": "assets/images/events/17.webp",
      
       "category": "",
       "description": "Recognition of Guru Nanak College of Pharmaceutical Sciences, Dehradun, as a leading institution in pharmaceutical education and research.Contribution to the advancement of the pharmaceutical industry by promoting innovation and knowledge sharing.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 November 2022"
     },
     {
      "id": "31",
       "name": "Chess and carrom competition",
       "title": "Chess and carrom competition",
       "date": "2022-11-26",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun, organized a spirited Chess and Carrom competition on the 26th of November 2022. The event aimed to promote strategic thinking, sportsmanship, and camaraderie among the students.The competition attracted enthusiastic participation from students across various departments of the college. Both beginners and seasoned players showcased their skills and passion for these intellectually stimulating games.",
       "image": "assets/images/events/18.webp",
      
       "category": "",
       "description": "The Chess and Carrom competition organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, proved to be a resounding success. Beyond the thrill of victory, the event fostered a sense of community, sportsmanship, and intellectual engagement among the participants. Such initiatives not only enhance the overall collegiate experience but also promote the values of strategy, resilience, and mutual respect among students.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 November 2022"
     },
     {
      "id": "30",
       "name": "Cricket and Badminton",
       "title": "Cricket and Badminton",
       "date": "2022-11-26",
       "about": "Guru Nanak College of Pharmaceutical Sciences, located in the serene city of Dehradun, organized a vibrant sports event on 26th November 2022. The event aimed to foster a sense of camaraderie among students while promoting physical fitness and healthy competition. The highlight of the day was the Cricket and Badminton Tournament, which brought together students from various disciplines to showcase their athletic prowess.",
       "image": "assets/images/events/17.webp",
      
       "category": "",
       "description": "Overall, the event was a testament to the college's dedication to nurturing both academic excellence and extracurricular achievements. As the day drew to a close, participants and spectators alike departed with memories of exhilarating matches and newfound friendships, eagerly anticipating future sporting events at Guru Nanak College of Pharmaceutical Sciences.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 November 2022"
     },
     {
      "id": "29",
       "name": "Volleyball",
       "title": "Volleyball",
       "date": "2022-11-25",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun, organized a thrilling Volleyball Competition on 25th November 2022. The event aimed to foster sportsmanship, teamwork, and physical fitness among the students, faculty, and staff members of the college.",
       "image": "assets/images/events/20.webp",
      
       "category": "",
       "description": "The Volleyball Competition organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a resounding success, bringing together students, faculty, and staff in a spirit of camaraderie and healthy competition. The event not only provided a platform for participants to showcase their sporting abilities but also promoted teamwork, physical fitness, and sportsmanship among the college community. Such initiatives play a crucial role in promoting a holistic development environment within the college campus.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"25 November 2022"
     },
     {
      "id": "28",
       "name": "Doodle making competition",
       "title": "Doodle making competition",
       "date": "2022-11-25",
       "about": "Guru Nanak College of Pharmaceutical Sciences, located in the serene city of Dehradun, organized an engaging and creative event - the Doodle Making Competition on November 25, 2022. The competition aimed to provide a platform for students to showcase their artistic talents and creativity through doodling.",
       "image": "assets/images/events/19.webp",
      
       "category": "",
       "description": "A panel of esteemed judges, comprising faculty members and professional artists, meticulously evaluated the doodles based on criteria such as creativity, relevance to the theme, artistic expression, and overall impact. The judging process was transparent and fair, ensuring that each participant received unbiased feedback.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"25 November 2022"
     },
     {
      "id": "27",
       "name": "Face painting",
       "title": "Face painting",
       "date": "2022-11-24",
       "about": "Guru Nanak College of Pharmaceutical Sciences, located in the serene city of Dehradun, organized a vibrant and creative event, the Face Painting Competition, on November 24, 2022. This competition aimed to showcase the artistic talents of the students and foster a spirit of creativity and expression among them.",
       "image": "assets/images/events/21.webp",
      
       "category": "",
       "description": "The competition provided a platform for students to unleash their creativity and explore their artistic abilities. It fostered a sense of camaraderie and healthy competition among the participants, as they exchanged ideas and techniques while engaging in friendly rivalry.The Face Painting Competition organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a resounding success, fostering creativity, artistic expression, and camaraderie among the students",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"24 November 2022"
     },
     {
      "id": "26",
       "name": "Cultural Activities - Solo Dance, Group Dance, Solo Singing, and Group Singing",
       "title": "Cultural Activities - Solo Dance, Group Dance, Solo Singing, and Group Singing",
       "date": "2022-11-23",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun, organized a vibrant and exhilarating Cultural Activities event on the 23rd of November 2022. The event featured a diverse range of talents showcasing their skills in Solo Dance, Group Dance, Solo Singing, and Group Singing competitions.",
       "image": "assets/images/events/22.webp",
      
       "category": "",
       "description": "The Cultural Activities event organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, proved to be a resounding success, fostering creativity, talent, and cultural appreciation among students. The event not only showcased the artistic prowess of the participants but also served as a platform for nurturing their confidence, passion, and aspirations. It was a testament to the college's commitment to holistic education and the promotion of extracurricular activities.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"23 November 2022"
     },
     {
      "id": "25",
       "name": "Blood Donation Camp",
       "title": "Blood Donation Camp",
       "date": "2022-11-22",
       "about": "Guru Nanak College of Pharmaceutical Sciences, situated in the serene valleys of Dehradun, organized a Blood Donation Camp on the 22nd of November 2022 under its NSS wing. The event aimed to contribute to the noble cause of saving lives by encouraging voluntary blood donations.",
       "image": "assets/images/events/23.webp",
      
       "category": "",
       "description": "The Blood Donation Camp organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, exemplified the institution's commitment to societal welfare and humanitarian values. Through active participation and unwavering support, the event underscored the importance of collective action in addressing crucial healthcare needs. It served as a reminder that small individual acts of kindness, such as blood donation, can collectively make a profound impact on society.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"22 November 2022"
     },
     {
      "id": "24",
       "name": "World Pharmacist Day",
       "title": "World Pharmacist Day",
       "date": "2022-09-24",
       "about": "Guru Nanak College of Pharmaceutical Sciences in Dehradun celebrated World Pharmacist Day on September 24, 2022, with great fervour and enthusiasm. The event aimed to recognize the invaluable contributions of pharmacists to healthcare and to promote the role of pharmacists in ensuring safe and effective medication use",
       "image": "assets/images/events/24.webp",
      
       "category": "",
       "description": "The World Pharmacist Day celebration at Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a resounding success, providing a platform for students and faculty to come together and celebrate the invaluable contributions of pharmacists to healthcare. The event not only promoted awareness about the role of pharmacists but also inspired students to pursue excellence in the field of pharmacy. It served as a reminder of the importance of continuous learning and professional development in advancing the practice of pharmacy for the betterment of society.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"24 September 2022"
     },
     {
      "id": "22",
       "name": "Vishwakarma Divas",
       "title": "Vishwakarma Divas",
       "date": "2022-09-17",
       "about": "Guru Nanak College of Pharmaceutical Sciences, located in the serene city of Dehradun, celebrated Vishwakarma Divas with great zeal and enthusiasm. Vishwakarma Divas, also known as Vishwakarma Jayanti, is a day dedicated to Lord Vishwakarma, the divine architect. It holds significant cultural and spiritual importance, especially among communities involved in craftsmanship and engineering.",
       "image": "assets/images/events/25.webp",
      
       "category": "",
       "description": "The Vishwakarma Divas celebration at Guru Nanak College of Pharmaceutical Sciences was a grand success, fostering a sense of community, innovation, and cultural pride among students, faculty, and industry professionals. The event served as a platform to honor the rich heritage of craftsmanship and creativity while emphasizing the importance of innovation and excellence in the pharmaceutical domain. It provided an excellent opportunity for networking, knowledge sharing, and skill development, ultimately contributing to the holistic growth of the participants and the advancement of the pharmaceutical sector.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"17 September 2022"
     },
     {
      "id": "21",
       "name": "Teachers' day",
       "title": "Teachers' day",
       "date": "2022-09-05",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun, celebrated Teachers' Day on September 5th, 2022, with great enthusiasm and fervor. The event aimed to honor and appreciate the dedication, hard work, and invaluable contributions of the teaching staff towards shaping the future of students.",
       "image": "assets/images/events/26.webp",
      
       "category": "",
       "description": "The Teachers' Day celebration at Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a resounding success, filled with moments of joy, gratitude, and camaraderie. It served as a fitting tribute to the hard work and dedication of the teaching staff, reaffirming their importance in shaping the future generation. The event concluded on a high note, leaving behind fond memories and a renewed sense of appreciation for the invaluable role played by teachers in the lives of students.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"05 September 2022"
     },
     {
      "id": "20",
       "name": "Yoga Day 2022 ",
       "title": "Yoga Day 2022 ",
       "date": "2022-06-21",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun organized a seminar on the occasion of International Yoga Day 2022. The event aimed to promote the practice of yoga among students and faculty members, emphasizing its benefits for physical and mental well-being.The seminar witnessed active participation from students, faculty members, and staff of Guru Nanak College of Pharmaceutical Sciences. Additionally, several yoga enthusiasts from the local community joined the event.",
       "image": "assets/images/events/27.webp",
      
       "category": "",
       "description": "The Seminar on Yoga Day 2022 organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a resounding success, fostering greater awareness about the holistic benefits of yoga. Participants gained valuable insights into incorporating yoga into their daily routines, thereby enhancing their overall health and well-being. The event served as a catalyst for promoting a culture of wellness and mindfulness within the college community and beyond.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"21 June 2022"
     },
     {
      "id": "19",
       "name": "Workshop 2022 Ethics in Research Paper Writing and Publication- An Important Issue",
       "title": "Workshop 2022 Ethics in Research Paper Writing and Publication- An Important Issue",
       "date": "2022-05-27",
       "about": "Guru Nanak College of Pharmaceutical Sciences, Dehradun, hosted a seminal workshop on May 27, 2022, focusing on the critical theme of Ethics in Research Paper Writing and Publication. The event aimed to enlighten participants about the ethical considerations involved in academic research and the publication process, thereby fostering integrity and quality in scholarly endeavors.",
       "image": "assets/images/events/33.webp",
      
       "category": "",
       "description": "The Workshop 2022 on Ethics in Research Paper Writing and Publication hosted by Guru Nanak College of Pharmaceutical Sciences, Dehradun, served as a platform for fostering ethical awareness and scholarly integrity among researchers and scholars. By delving into the intricacies of research ethics and publication standards, the event empowered participants to uphold the highest ethical standards in their academic endeavors, thereby contributing to the advancement of knowledge with integrity and accountability.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"27 May 2022"
     },
     {
      "id": "18",
       "name": "Farewell 2022",
       "title": "Farewell 2022",
       "date": "2022-05-27",
       "about": "The Guru Nanak College of Pharmaceutical Sciences, Dehradun in Dehradun bid adieu to its graduating students of 2022 with a heart-warming farewell event on May 27th, 2022. The event, aptly named Farewell 2022, was a memorable occasion filled with emotions, nostalgia, and fond reminiscences.",
       "image": "assets/images/events/31.webp",
      
       "category": "",
       "description": "The Farewell 2022 event at Guru Nanak College of Pharmaceutical Sciences, Dehradun, was a poignant yet joyous occasion, celebrating the achievements and bidding farewell to the graduating students of 2022. It served as a fitting tribute to their academic journey, filled with moments of laughter, tears, and camaraderie. As they embark on new beginnings, the departing students carry with them the cherished memories and invaluable experiences gained during their time at the college, while the institution fondly remembers their contributions and wishes them success in all their future endeavors.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"27 May 2022"
     },
     {
      "id": "17",
       "name": "Holi 2022 - Ullash, 2022",
       "title": "Holi 2022 - Ullash, 2022",
       "date": "2022-03-15",
       "about": "Guru Nanak College of Pharmaceutical Sciences celebrated the festival of colors, Holi, with great fervor and enthusiasm. The event, named Holi-Ullash, aimed to bring together students, faculty, and staff to rejoice in the spirit of unity, joy, and cultural harmony.",
       "image": "assets/images/events/12.webp",
      
       "category": "",
       "description": "The celebration of Holi “Ullash” not only served as a platform for cultural exchange but also highlighted the significance of unity, diversity, and harmony. It emphasized the importance of celebrating festivals as a means of fostering communal bonds and spreading happiness",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"15 March 2022"
     },
     {
      "id": "16",
       "name": "Republic Day",
       "title": "Republic Day",
       "date": "2022-01-26",
       "about": "On January 26, 2022, Guru Nanak College of Pharmaceutical Sciences, organized a seminar to commemorate Republic Day. The event aimed to instill a sense of patriotism and highlight the significance of this important day in the history of India. It also provided a platform for students and faculty to engage in discussions and gain insights into various aspects of the Indian Republic.",
       "image": "assets/images/events/28.webp",
      
       "category": "",
       "description": "The Seminar on Republic Day organized by Guru Nanak College of Pharmaceutical Sciences, Dehradun, served as a platform for fostering patriotism, promoting awareness about the Indian Constitution, and encouraging active participation in nation-building activities. The event successfully achieved its objectives of inspiring the youth to uphold the values of democracy and contribute towards the development of the nation.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"26 January 2022"
     },
     {
      "id": "15",
       "name": "Makar Sankranti",
       "title": "Makar Sankranti",
       "date": "2022-01-14",
       "about": "The NSS annex of Guru Nanak College of Pharmaceutical Sciences, Dehradun organized a seminar on the auspicious occasion of Makar Sankranti, a festival celebrated across India marking the transition of the sun into the zodiac sign of Capricorn. The event aimed to explore the cultural significance, traditions, and scientific aspects associated with Makar Sankranti.",
       "image": "assets/images/events/29.webp",
      
       "category": "",
       "description": "The Makar Sankranti seminar hosted by Guru Nanak College of Pharmaceutical Sciences, Dehradun was a resounding success, providing attendees with a comprehensive understanding of the festival's cultural, scientific, and social significance. The event fostered cultural appreciation, academic discourse, and community engagement, reflecting the college's commitment to holistic education and societal enrichment.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"14 January 2022"
     },
     {
      "id": "14",
       "name": "Road Safety Program",
       "title": "Road Safety Program",
       "date": "2021-12-14",
       "about": "The Road Safety Program organized by the NSS Wing of Guru Nanak College of Pharmaceutical Sciences, Dehradun, on 14-12-2021, was a resounding success, attracting active participation from students, faculty, and members of the local community.",
       "image": "assets/images/events/41.webp",
      
       "category": "",
       "description": "The Road Safety Program concluded on a high note, with participants expressing appreciation for the valuable knowledge and skills gained during the event. The NSS Wing of Guru Nanak College of Pharmaceutical Sciences, Dehradun reaffirmed its commitment to organizing similar initiatives in the future, to create a safer and more responsible road culture in the region.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"14 December 2021"
     },
     {
      "id": "13",
       "name": "Fire Protection Awareness Programs",
       "title": "Fire Protection Awareness Programs",
       "date": "2021-11-29",
       "about": "The Fire Protection Awareness Program organized by the NSS Wing of Guru Nanak College of Pharmaceutical Sciences, Dehradun, on November 29, 2021, was a resounding success, attracting enthusiastic participation from students, faculty members, and local residents.",
       "image": "assets/images/events/40.webp",
      
       "category": "",
       "description": "Overall, the Fire Protection Awareness Program achieved its objectives of raising awareness, promoting safety practices, empowering participants, and encouraging preparedness. By equipping individuals with the knowledge and skills to prevent and respond to fire incidents, the event contributed to enhancing the safety and well-being of the community at large.",
       "subtitle": "Guru Nanak College of Pharmaceutical Sciences",
       "eventdate":"29 November 2021"
     },
     {
      "id": "12",
       "name": "Awareness of Water conservation",
       "title": "Awareness of Water conservation",
       "date": "2021-06-09",
       "about": "The NSS Arm of Kukreja Institute of Pharmaceutical Sciences, Dehradun, organized an event titled Awareness on Water Conservation on 9th June 2021. The event aimed to educate students about the importance of conserving water and promote sustainable practices for preserving this vital natural resource.",
       "image": "assets/images/events/48.webp",
      
       "category": "",
       "description": "Overall, the Awareness on Water Conservation event was a resounding success, achieving its objectives of raising awareness, educating students, and fostering a sense of responsibility toward environmental stewardship. It catalysed promoting sustainable practices and empowering students to make a positive impact on their environment.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"09 June 2021"
     },
     {
      "id": "11",
       "name": "Oral Hygiene Awareness",
       "title": "Oral Hygiene Awareness",
       "date": "2021-03-25",
       "about": "The NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun organized an Oral Hygiene Awareness event on March 25, 2021, to educate participants about the importance of oral health and promote preventive measures against common oral diseases. The event witnessed active participation from students, faculty, and staff members.",
       "image": "assets/images/events/47.webp",
      
       "category": "",
       "description": "The event concluded with a pledge-taking ceremony, where participants vowed to prioritize their oral health and spread awareness within their communities. Overall, the Oral Hygiene Awareness event was highly successful in achieving its objectives of raising awareness, promoting behavioral change, fostering community engagement, and empowering participants with the knowledge and skills necessary for maintaining good oral health.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"25 March 2021"
     },
     {
      "id": "10",
       "name": "Cleanliness Drive",
       "title": "Cleanliness Drive",
       "date": "2021-03-24",
       "about": "The Cleanliness Drive organized by the NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, on 24-03-2021, was a resounding success. The event aimed to raise awareness about the importance of cleanliness and to actively engage students and faculty members in a community service initiative.",
       "image": "assets/images/events/39.webp",
      
       "category": "",
       "description": "Overall, the Cleanliness Drive proved to be an impactful initiative, aligning with the principles of community service and environmental stewardship upheld by the Kukreja Institute of Pharmaceutical Sciences, Dehradun.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"24 March 2021"
     },
     {
      "id": "09",
       "name": "Cloth Donation Drive",
       "title": "Cloth Donation Drive",
       "date": "2020-01-28",
       "about": "The Cloth Donation Drive organized by the NSS team of Kukreja Institute of Pharmaceutical Sciences, Dehradun, on January 28, 2020, was a resounding success, achieving its objectives of community service, social responsibility promotion, and environmental awareness.",
       "image": "assets/images/events/38.webp",
      
       "category": "",
       "description": "In conclusion, the Cloth Donation Drive not only provided tangible support to underprivileged communities but also fostered a sense of unity and compassion among participants. The event exemplified the values of service and empathy promoted by the NSS section of Kukreja Institute of Pharmaceutical Sciences, reinforcing its commitment to making a positive difference in society.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"28 January 2020"
     },
     {
      "id": "08",
       "name": "Say No to Drugs Rally",
       "title": "Say No to Drugs Rally",
       "date": "2020-01-01",
       "about": "The Say No to Drugs Rally organized by the NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, was successfully held on January 1, 2020. The event aimed to raise awareness about the adverse effects of drug abuse and promote a drug-free lifestyle in the community.",
       "image": "assets/images/events/46.webp",
      
       "category": "",
       "description": "In conclusion, the Say No to Drugs Rally proved to be a significant milestone in the ongoing efforts to address the issue of drug abuse in Dehradun. By raising awareness, promoting prevention measures, and fostering community engagement, the event contributed towards building a healthier and more resilient society, free from the scourge of drugs.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"01 January 2020"
     },
     {
      "id": "07",
       "name": "Yoga and Meditation Session",
       "title": "Yoga and Meditation Session",
       "date": "2019-11-30",
       "about": "The Yoga and Meditation Session organized by the NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, on November 30, 2019, was a resounding success. The event aimed to promote physical and mental well-being among students and staff members through the practice of yoga and meditation.",
       "image": "assets/images/events/45.webp",
      
       "category": "",
       "description": "Overall, the Yoga and Meditation Session served its objectives of promoting holistic wellness and raising awareness about the importance of incorporating such practices into daily life. The event received positive feedback from participants, encouraging the NSS Wing to continue organizing similar initiatives in the future.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"30 November 2019"
     },
     {
      "id": "06",
       "name": "Pharmacy Day 2019",
       "title": "Pharmacy Day 2019",
       "date": "2019-09-25",
       "about": "Pharmacy Day 2019, organized by Kukreja Institute of Pharmaceutical Sciences, Dehradun was a significant event aimed at celebrating the role of pharmacists in healthcare and promoting awareness about various aspects of the pharmaceutical industry.",
       "image": "assets/images/events/30.webp",
      
       "category": "",
       "description": "Pharmacy Day 2019 at Kukreja Institute of Pharmaceutical Sciences, Dehradun, was a resounding success, providing a platform for knowledge exchange, networking, and celebration within the pharmacy community. The event underscored the vital role of pharmacists in healthcare and inspired participants to strive for excellence in their academic and professional pursuits. With its diverse range of activities and engaging sessions, Pharmacy Day 2019 left a lasting impression on all those who attended, reaffirming the college's commitment to advancing pharmaceutical education and research.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"25 September 2019"
     },
     {
      "id": "05",
       "name": "Swachhata Abhiyaan",
       "title": "Swachhata Abhiyaan",
       "date": "2019-08-15",
       "about": "The NSS team of Kukreja Institute of Pharmaceutical Sciences, Dehradun, organized a Swachhata Abhiyaan event on 15th August 2019 to commemorate the spirit of cleanliness and hygiene. The event aimed to foster a sense of responsibility towards cleanliness among students and promote the Swachh Bharat Abhiyaan initiated by the Government of India.",
       "image": "assets/images/events/36.webp",
      
       "category": "",
       "description": "The Swachhata Abhiyaan event organized by Kukreja Institute of Pharmaceutical Sciences, Dehradun, was a resounding success, garnering active participation and enthusiasm from students, faculty, and staff alike. Through various activities such as clean-up drives, awareness campaigns, poster-making competitions, and plantation drives, the event effectively promoted the ideals of cleanliness, hygiene, and environmental stewardship. It underscored the college's commitment to fostering a culture of responsibility toward maintaining a clean and sustainable environment. Such initiatives not only contribute to the Swachh Bharat Abhiyaan but also nurture a sense of civic consciousness and social responsibility among the youth, thereby paving the way for a cleaner and greener future.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"15 August 2019"
     },
     {
      "id": "04",
       "name": "WORLD NO TOBACCO DAY",
       "title": "WORLD NO TOBACCO DAY",
       "date": "2019-05-31",
       "about": "The NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, organized a successful event to commemorate World No Tobacco Day on May 31, 2019. The event aimed to raise awareness about the harmful effects of tobacco consumption and promote tobacco cessation among students and the community.",
       "image": "assets/images/events/37.webp",
      
       "category": "",
       "description": "In conclusion, the World No Tobacco Day event organized by the NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, effectively raised awareness about the harmful effects of tobacco and encouraged tobacco cessation among students and the community. It served as a significant step towards creating a tobacco-free environment and promoting the well-being of individuals.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"31 May 2019"
     },
     {
      "id": "03",
       "name": "Literacy programs",
       "title": "Literacy programs",
       "date": "2019-01-07",
       "about": "The Literacy Program organized by the NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun, on 07-01-2019, was a resounding success, achieving its objectives and leaving a positive impact on all participants.",
       "image": "assets/images/events/43.webp",
      
       "category": "",
       "description": "In conclusion, the Literacy Program organized by the NSS Wing was instrumental in raising awareness about the importance of literacy, engaging students in community service, and empowering individuals through education. It served as a testament to the college's commitment to social responsibility and its dedication to fostering a culture of learning and empowerment.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"07 January 2019"
     },
     {
      "id": "02",
       "name": "Tree Plantations and Conservations",
       "title": "Tree Plantations and Conservations",
       "date": "2018-11-22",
       "about": "On November 22, 2018, Kukreja Institute of Pharmaceutical Sciences, Dehradun, organized a Tree Plantation and Conservation event under the NSS wing to promote environmental sustainability and raise awareness about the importance of preserving our natural resources. The event brought together students, faculty members, and local community members to contribute towards a greener and healthier environment.",
       "image": "assets/images/events/35.webp",
      
       "category": "",
       "description": "The event fostered a sense of environmental responsibility among the participants, motivating them to become ambassadors for sustainability in their communities.The Tree Plantation and Conservation event organized by Kukreja Institute of Pharmaceutical Sciences, Dehradun, served as a significant step towards fostering environmental consciousness and promoting sustainable living practices. Through collective efforts, the event not only contributed to the greening of the college campus but also inspired individuals to actively participate in conservation activities for a better and greener tomorrow.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"22 November 2018"
     },
     {
      "id": "01",
       "name": "Youth Awakening Day",
       "title": "Youth Awakening Day",
       "date": "2018-10-15",
       "about": "The NSS Wing of Kukreja Institute of Pharmaceutical Sciences, Dehradun organized the Youth Awakening Day on October 15, 2018, to inspire and empower young minds to actively engage in addressing societal issues. The event witnessed enthusiastic participation from students across various disciplines.",
       "image": "assets/images/events/42.webp",
       "category": "",
       "description": "The event concluded with a pledge-taking ceremony, where participants vowed to actively contribute to societal welfare and uphold the values of compassion, empathy, and inclusivity. It marked the beginning of a journey towards collective action and positive change, as the youth pledged to be torchbearers of social transformation.",
       "subtitle": "Kukreja Institute of Pharmaceutical Sciences, Dehradun",
       "eventdate":"15 October 2018"
     }
  ]