[
    {
      "id": "04",
      "name": "Research workshop on Systematic Approach to Pharmaceutical Care",
      "title": "Research workshop on Systematic Approach to Pharmaceutical Care",
      "about": "The Workshop on Systematic Approach to Pharmaceutical Care held at the Guru Nanak College of Pharmaceutical Sciences on July 25, 2023, was facilitated by Ms. Bhawna Bora for B.Pharm students. With over 80 participants, the workshop aimed to impart practical skills and insights into patient-centered pharmacy practice. Through structured sessions, case-based learning, role-playing exercises, and interactive discussions, students gained valuable knowledge and competencies essential for delivering effective pharmaceutical care. The workshop successfully achieved its objectives, providing a platform for professional development and preparing students for their future roles as competent pharmacists.",
      "image": "assets/images/Research/Research-1.webp",
      "description": "The Workshop on Systematic Approach to Pharmaceutical Care, organized by the Guru Nanak College of Pharmaceutical Sciences and facilitated by Ms. Bhawna Bora, was highly successful in achieving its objectives. Through structured sessions, case-based learning, role-playing exercises, and interactive discussions, students gained valuable insights and practical skills essential for delivering patient-centered pharmaceutical care. The workshop served as a platform for fostering professional development and preparing students for their future roles as competent and compassionate pharmacists.",
      "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
      "eventdate": "25 July 2023"
    },
    {
        "id": "04",
        "name": "Research Seminar on How to Design Future Medicines",
        "title": "Research Seminar on How to Design Future Medicines",
        "about": "The Research Seminar on How to Design Future Medicines, conducted by Ms. Kriti Dabral on behalf of the Guru Nanak College of Pharmaceutical Sciences Dehradun (GNC), took place on July 8, 2023.",
        "image": "assets/images/Research/Research-2.webp",
        "description": "The Research Seminar on How to Design Future Medicines, organized by the Guru Nanak College of Pharmaceutical Sciences Dehradun (GNC) and led by Ms. Kriti Dabral, went out to be a very successful one. The event effectively fulfilled its objectives of educating B.Pharm students about the details of pharmaceutical research and inspiring them to contribute to the development of future medicines. With its informative sessions and interactive discussions, the seminar proved to be a valuable learning experience for all attendees.",
        "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
        "eventdate": "8 July 2023"
    },
    {
        "id": "04",
        "name": "Research Seminar on Advances in Pharmaceutical Technology",
        "title": "Research Seminar on Advances in Pharmaceutical Technology",
        "about": "The seminar commenced with an opening address by Mrs. Yashika Uniyal, highlighting the significance of staying updated with the latest developments in pharmaceutical technology for aspiring pharmacists. This was followed by the keynote speech delivered by Kriti Dabral, wherein she shared her insights into emerging trends and future prospects in the field. Subsequent sessions featured presentations by faculty members and invited experts, each focusing on a specific aspect of pharmaceutical technology. The presentations were well-received, stimulating thought-provoking discussions among the attendees. In addition to the formal sessions, the seminar also included poster presentations by students, showcasing their research projects and findings. This provided a platform for students to exhibit their work and receive feedback from peers and faculty members.",
        "image": "assets/images/Research/Research-3.webp",
        "description": "Overall, the Research Seminar on Advances in Pharmaceutical Technology proved to be a resounding success, achieving its objectives of educating, inspiring, and empowering B.Pharm students to excel in their academic and professional pursuits. The event concluded with a vote of thanks, expressing gratitude to the speakers, organizers, and participants for their contributions towards making the seminar a memorable and enriching experience. This report encapsulates the essence of the seminar, highlighting its significance in nurturing the future leaders of the pharmaceutical industry and fostering innovation and excellence in pharmaceutical technology.",
        "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
        "eventdate": "14 April 2023"
    },
    {
        "id": "04",
        "name": "PMBJP",
        "title": "Seminar on Introducing Pradhan Mantri Bhartiya Janaushadhi Pariyojana (PMBJP) for Pharma Students",
        "about": "Guru Nanak College of Pharmaceutical Sciences organized a seminar titled Introducing Pradhan Mantri Bhartiya Janaushadhi Pariyojana (PMBJP) for Pharma students on March 06, 2023. The seminar aimed to educate B.Pharm students about the PMBJP initiative and its significance in the healthcare sector.",
        "image": "assets/images/Research/Research-5.webp",
        "description": "The Seminar on Introducing Pradhan Mantri Bhartiya Janaushadhi Pariyojana (PMBJP) organized by Guru Nanak College of Pharmaceutical Sciences proved to be an informative and enlightening event for B.Pharm students. Dr. Vishal Deshwal's expertise and the interactive nature of the seminar facilitated a meaningful exchange of knowledge and insights. The seminar successfully raised awareness about the PMBJP initiative and its significance in addressing healthcare challenges, particularly in terms of medicine accessibility and affordability. Overall, the event served its purpose of empowering students with the knowledge and awareness to contribute positively to the healthcare sector, aligning with the objectives of the PMBJP program.",
        "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
        "eventdate": "06 March 2023"
    },
    {
        "id": "04",
        "name": "IPR",
        "title": "Seminar on Introduction to Intellectual Property Rights (IPR)",
        "about": "The seminar commenced with an introduction by the organizing committee, highlighting the importance of intellectual property rights in the context of pharmaceutical innovation and entrepreneurship.",
        "image": "assets/images/Research/Research-6.webp",
        "description": "The presentations were informative and engaging, providing students with valuable insights into the legal, ethical, and practical aspects of intellectual property rights in the pharmaceutical domain. The speakers shared real-world examples and case studies to illustrate the significance of protecting intellectual property assets and leveraging them for competitive advantage. The event concluded with a closing remark, expressing gratitude to the speaker Mr. Ankur Jaiswal, organizers, and participants for their active involvement and contributions towards making the seminar a success. Participants were encouraged to further explore the field of intellectual property rights and leverage their knowledge to drive innovation and value creation in the pharmaceutical industry. In summary, the Seminar on Introduction to Intellectual Property Rights (IPR) proved to be a valuable learning experience for B.Pharm students, equipping them with essential knowledge and skills to navigate the complex landscape of intellectual property protection and management in the pharmaceutical sector. The event underscored the importance of fostering a culture of innovation, creativity, and ethical responsibility in pharmaceutical research and development, laying the foundation for future success and growth in the industry.",
        "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
        "eventdate": "03 March 2023"
    },
    {
        "id": "04",
        "name": "Seminar on Patent Filing System in Pharmacy",
        "title": "Seminar on Patent Filing System in Pharmacy",
        "about": "The seminar commenced with an introductory session wherein the significance of patents in the pharmaceutical industry was explained. The speakers Dr. C Subramanian highlighted the role of patents in incentivizing innovation, protecting inventions, and fostering growth in the pharmaceutical sector. Following the introduction, the seminar explored into various aspects of the patent filing system.",
        "image": "assets/images/Research/Research-7.webp",
        "description": "The presentations were delivered by experienced faculty members and invited expert Dr. C Subramanian with expertise in patent law and pharmaceutical sciences. Real-world examples and case studies were discussed to provide students with practical insights into the patent filing process and its implications for pharmaceutical research, development, and commercialization. The seminar provided a platform for students to learn from industry professionals, ask questions, and gain a deeper understanding of the practical implications of patent protection in pharmacy. The event concluded with a closing remark, expressing gratitude to the speakers, organizers, and participants for their active involvement and contributions towards making the seminar a success. Participants were encouraged to further explore the field of patent law and intellectual property rights, leveraging their knowledge to drive innovation and contribute to the advancement of the pharmaceutical industry. In summary, the Seminar on Patent Filing System in Pharmacy proved to be an enriching and informative experience for B.Pharm students, equipping them with essential knowledge and skills to navigate the patent filing process and protect their inventions in the pharmaceutical domain. The event underscored the importance of intellectual property protection in fostering innovation, driving growth, and ensuring competitiveness in the pharmaceutical sector.",
        "subtitle": "The Guru Nanak College of Pharmaceutical Sciences",
        "eventdate": "20 January 2023"
    }
]